index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-16 Sun 12:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="alexander" />
<link href="css/htmlize.css" rel="stylesheet" type="text/css" />
<link href="css/readtheorg.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1179c5e">1. Core</a>
<ul>
<li><a href="#org38985d3">1.1. Package</a></li>
<li><a href="#org4fa145f">1.2. Libraries</a>
<ul>
<li><a href="#orgc7d285a">1.2.1. config</a></li>
<li><a href="#org3eebfe8">1.2.2. packages</a></li>
</ul>
</li>
<li><a href="#orgbf109d5">1.3. Linux</a></li>
<li><a href="#orgee3e923">1.4. macOS</a></li>
</ul>
</li>
<li><a href="#org7ef104f">2. Modules</a>
<ul>
<li><a href="#org2c47e8f">2.1. General</a></li>
<li><a href="#orgfac11db">2.2. Appearance</a>
<ul>
<li><a href="#org33b659f">2.2.1. config</a></li>
<li><a href="#org6b4704b">2.2.2. Icons</a></li>
<li><a href="#org9e300eb">2.2.3. Doom</a></li>
<li><a href="#orge689bf2">2.2.4. Discoverability</a></li>
<li><a href="#org71e9979">2.2.5. Defaults</a></li>
</ul>
</li>
<li><a href="#org0bd78bc">2.3. Navigation</a>
<ul>
<li><a href="#orgf6eca7e">2.3.1. config</a></li>
<li><a href="#orgada5f1c">2.3.2. Buffers and Windows</a></li>
<li><a href="#org354d744">2.3.3. Directory</a></li>
</ul>
</li>
<li><a href="#org2685feb">2.4. Editor</a>
<ul>
<li><a href="#org7888e03">2.4.1. config</a></li>
<li><a href="#org953d022">2.4.2. Jump / Goto</a></li>
<li><a href="#org570ee44">2.4.3. Selection / Insertion</a></li>
<li><a href="#org3026baa">2.4.4. Syntax checking</a></li>
<li><a href="#org2916a71">2.4.5. Search / Replace</a></li>
<li><a href="#org0c45641">2.4.6. Completion</a></li>
<li><a href="#orgf864bba">2.4.7. Utilities</a></li>
</ul>
</li>
<li><a href="#org874374d">2.5. Project Management</a>
<ul>
<li><a href="#org5c1d7fb">2.5.1. projectile: Manage and navigate projects in Emacs easily</a></li>
<li><a href="#orge6418b2">2.5.2. ibuffer-projectile: Group ibuffer's list by projectile root</a></li>
</ul>
</li>
<li><a href="#orgbe1b8dc">2.6. Version Control</a>
<ul>
<li><a href="#orgdf3325a">2.6.1. magit: Interface to the version control system Git</a></li>
<li><a href="#org0173b14">2.6.2. gist: Emacs integration for gist.github.com</a></li>
<li><a href="#org24669e8">2.6.3. git-timemachine: Walk through git revisions of a file</a></li>
<li><a href="#orga136c19">2.6.4. gitpatch</a></li>
</ul>
</li>
<li><a href="#org20c6a72">2.7. Languages</a>
<ul>
<li><a href="#orgd90d365">2.7.1. org-mode: a powerful system for organizing your complex life with simple plain-text files</a></li>
<li><a href="#orgcd5b346">2.7.2. Markup</a></li>
<li><a href="#org49a3a46">2.7.3. Utilities</a></li>
<li><a href="#orge648e97">2.7.4. Epub</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1179c5e" class="outline-2">
<h2 id="org1179c5e"><span class="section-number-2">1</span> Core</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org38985d3" class="outline-3">
<h3 id="org38985d3"><span class="section-number-3">1.1</span> Package</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">`(online?)` is a function that tries to detect whether you are online.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">We want to refresh our package list on Emacs start if we are.</span>
(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">cl</span>)
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">online?</span> ()
  (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">and</span> (functionp 'network-interface-list)
           (network-interface-list))
      (some (<span style="color: #51afef;">lambda</span> (iface) (<span style="color: #51afef;">unless</span> (equal <span style="color: #98be65;">"lo"</span> (car iface))
                              (member 'up (first (last (network-interface-info
                                                        (car iface)))))))
            (network-interface-list))
    t))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Emacs comes with a package manager for installing more features.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">The default package repository doesn't contain much, so we tell it</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">to use MELPA as well.</span>
(<span style="color: #51afef;">setq</span> package-user-dir (concat dotfiles-dir <span style="color: #98be65;">"elpa"</span>))
(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">package</span>)
(add-to-list 'package-archives '(<span style="color: #98be65;">"melpa"</span> . <span style="color: #98be65;">"https://melpa.org/packages/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #98be65;">"org"</span> . <span style="color: #98be65;">"http://orgmode.org/elpa/"</span>) t)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">To get the package manager going, we invoke its initialise function.</span>
(package-initialize)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">If we're online, we attempt to fetch the package directories if</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">we don't have a local copy already. This lets us start installing</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">packages right away from a clean install.</span>
(<span style="color: #51afef;">when</span> (online?)
  (<span style="color: #51afef;">unless</span> package-archive-contents (package-refresh-contents)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">`</span><span style="color: #a9a1e1;">Paradox</span><span style="color: #5B6268;">' is an enhanced interface for package management, which also</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">provides some helpful utility functions we're going to be using</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">extensively. Thus, the first thing we do is install it if it's not there</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">already.</span>
(<span style="color: #51afef;">when</span> (not (package-installed-p 'paradox))
  (package-install 'paradox))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">We're going to be using `</span><span style="color: #a9a1e1;">use-package</span><span style="color: #5B6268;">' to manage our dependencies.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">In its simplest form, we can call eg. `(use-package lolcode-mode)'</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">to install the `</span><span style="color: #a9a1e1;">lolcode-mode</span><span style="color: #5B6268;">' package. We'd also declare one or more</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">entry points so the module isn't loaded unneccesarily at startup.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">For instance, `(use-package my-module :commands (my-function))' will</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">defer loading `</span><span style="color: #a9a1e1;">my-module</span><span style="color: #5B6268;">' until you actually call `(my-function)'.</span>
<span style="color: #5B6268;">;;</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Read about it in detail at https://github.com/jwiegley/use-package</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">First, we make sure it's installed, using a function provided by</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Paradox, which we've just installed the hard way.</span>
(paradox-require 'use-package)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Next, we load it so it's always available.</span>
(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">use-package</span>)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Finally, we enable `</span><span style="color: #a9a1e1;">use-package-always-ensure</span><span style="color: #5B6268;">' which makes</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">use-package install every declared package automatically from ELPA,</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">instead of expecting you to do it manually.</span>
(<span style="color: #51afef;">setq</span> use-package-always-ensure t)


</pre>
</div>
</div>
</div>
