index.html
<div id="outline-container-org4fa145f" class="outline-3">
<h3 id="org4fa145f"><span class="section-number-3">1.2</span> Libraries</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc7d285a" class="outline-4">
<h4 id="orgc7d285a"><span class="section-number-4">1.2.1</span> config</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">eval-when-compile</span> (<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">cl-lib</span>))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/font-lock-replace-symbol</span> (mode reg sym)
  <span style="color: #83898d;">"Given a major mode `</span><span style="color: #a9a1e1;">mode</span><span style="color: #83898d;">', replace the regular expression `</span><span style="color: #a9a1e1;">reg</span><span style="color: #83898d;">' with</span>
<span style="color: #83898d;"> the symbol `</span><span style="color: #a9a1e1;">sym</span><span style="color: #83898d;">' when rendering."</span>
  (font-lock-add-keywords
   mode `((,reg
           (0 (<span style="color: #51afef;">progn</span> (compose-region (match-beginning 1) (match-end 1)
                                     ,sym 'decompose-region)))))))
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/exec</span> (command)
  <span style="color: #83898d;">"Run a shell command and return its output as a string, whitespace trimmed."</span>
  (s-trim (shell-command-to-string command)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/exec-with-rc</span> (command <span style="color: #ECBE7B;">&amp;rest</span> args)
  <span style="color: #83898d;">"Run a shell command and return a list containing two values: its return</span>
<span style="color: #83898d;"> code and its whitespace trimmed output."</span>
  (<span style="color: #51afef;">with-temp-buffer</span>
    (list (apply 'call-process command nil (current-buffer) nil args)
          (s-trim (buffer-string)))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/is-exec</span> (command)
  <span style="color: #83898d;">"Returns true if `</span><span style="color: #a9a1e1;">command</span><span style="color: #83898d;">' is an executable on the system search path."</span>
  (f-executable? (s-trim (shell-command-to-string (s-concat <span style="color: #98be65;">"which "</span> command)))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/resolve-exec</span> (command)
  <span style="color: #83898d;">"If `</span><span style="color: #a9a1e1;">command</span><span style="color: #83898d;">' is an executable on the system search path, return its absolute path.</span>
<span style="color: #83898d;"> Otherwise, return nil."</span>
  (<span style="color: #51afef;">-let</span> [path (s-trim (shell-command-to-string (s-concat <span style="color: #98be65;">"which "</span> command)))]
    (<span style="color: #51afef;">when</span> (f-executable? path) path)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/exec-if-exec</span> (command args)
  <span style="color: #83898d;">"If `</span><span style="color: #a9a1e1;">command</span><span style="color: #83898d;">' satisfies `</span><span style="color: #a9a1e1;">core/is-exec</span><span style="color: #83898d;">', run it with `</span><span style="color: #a9a1e1;">args</span><span style="color: #83898d;">' and return its</span>
<span style="color: #83898d;"> output as per `</span><span style="color: #a9a1e1;">core/exec</span><span style="color: #83898d;">'. Otherwise, return nil."</span>
  (<span style="color: #51afef;">when</span> (core/is-exec command) (core/exec (s-concat command <span style="color: #98be65;">" "</span> args))))



(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/getent</span> (user)
  <span style="color: #83898d;">"Get the /etc/passwd entry for the user `</span><span style="color: #a9a1e1;">user</span><span style="color: #83898d;">' as a list of strings,</span>
<span style="color: #83898d;"> or nil if there is no such user. Empty fields will be represented as nil,</span>
<span style="color: #83898d;"> as opposed to empty strings."</span>
  (<span style="color: #51afef;">-let</span> [ent (core/exec (s-concat <span style="color: #98be65;">"getent passwd "</span> user))]
    (<span style="color: #51afef;">when</span> (not (s-blank? ent))
      (<span style="color: #51afef;">-map</span> (<span style="color: #51afef;">lambda</span> (i) (<span style="color: #51afef;">if</span> (s-blank? i) nil i))
            (s-split <span style="color: #98be65;">":"</span> ent)))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/user-full-name</span> ()
  <span style="color: #83898d;">"Guess the user's full name. Returns nil if no likely name could be found."</span>
  (<span style="color: #51afef;">or</span> (core/exec-if-exec <span style="color: #98be65;">"git"</span> <span style="color: #98be65;">"config --get user.name"</span>)
      (elt (core/getent (getenv <span style="color: #98be65;">"USER"</span>)) 4)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">core/user-email</span> ()
  <span style="color: #83898d;">"Guess the user's email address. Returns nil if none could be found."</span>
  (<span style="color: #51afef;">or</span> (core/exec-if-exec <span style="color: #98be65;">"git"</span> <span style="color: #98be65;">"config --get user.email"</span>)
      (getenv <span style="color: #98be65;">"EMAIL"</span>)))

(<span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">after!</span> (feature <span style="color: #ECBE7B;">&amp;rest</span> forms)
  <span style="color: #83898d;">"A smart wrapper around `</span><span style="color: #a9a1e1;">with-eval-after-load</span><span style="color: #83898d;">'. Supresses warnings during</span>
<span style="color: #83898d;">compilation."</span>
  (<span style="color: #51afef;">declare</span> (indent defun) (debug t))
  `(,(<span style="color: #51afef;">if</span> (<span style="color: #51afef;">or</span> (not (<span style="color: #51afef;">bound-and-true-p</span> byte-compile-current-file))
             (<span style="color: #51afef;">if</span> (symbolp feature)
                 (<span style="color: #51afef;">require</span> <span style="color: #a9a1e1;">feature</span> nil <span style="color: #c678dd;">:no-error</span>)
               (load feature <span style="color: #c678dd;">:no-message</span> <span style="color: #c678dd;">:no-error</span>)))
         #'progn
       #'with-no-warnings)
    (<span style="color: #51afef;">with-eval-after-load</span> ',feature ,@forms)))


(<span style="color: #51afef;">eval-and-compile</span>

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/resolve-hook-forms</span> (hooks)
    (<span style="color: #51afef;">cl-loop</span> with quoted-p = (eq (car-safe hooks) 'quote)
             for hook in (doom-enlist (doom-unquote hooks))
             if (eq (car-safe hook) 'quote)
             collect (cadr hook)
             else if quoted-p
             collect hook
             else collect (intern (format <span style="color: #98be65;">"%s-hook"</span> (symbol-name hook)))))

  (<span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">my/transient-counter</span> 0)
  (<span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">add-transient-hook!</span> (hook <span style="color: #ECBE7B;">&amp;rest</span> forms)
    <span style="color: #83898d;">"Attaches transient forms to a HOOK.</span>

<span style="color: #83898d;">    HOOK can be a quoted hook or a sharp-quoted function (which will be advised).</span>

<span style="color: #83898d;">    These forms will be evaluated once when that function/hook is first invoked,</span>
<span style="color: #83898d;">    then it detaches itself."</span>
    (<span style="color: #51afef;">declare</span> (indent 1))
    (<span style="color: #51afef;">let</span> ((append (eq (car forms) <span style="color: #c678dd;">:after</span>))
          (fn (intern (format <span style="color: #98be65;">"my/transient-hook-%s"</span> (<span style="color: #51afef;">cl-incf</span> my/transient-counter)))))
      `(<span style="color: #51afef;">when</span> ,hook
         (fset ',fn
               (<span style="color: #51afef;">lambda</span> (<span style="color: #ECBE7B;">&amp;rest</span> _)
                 ,@forms
                 (<span style="color: #51afef;">cond</span> ((functionp ,hook) (advice-remove ,hook #',fn))
                       ((symbolp ,hook)   (remove-hook ,hook #',fn)))
                 (unintern ',fn nil)))
         (<span style="color: #51afef;">cond</span> ((functionp ,hook)
                (advice-add ,hook ,(<span style="color: #51afef;">if</span> append <span style="color: #c678dd;">:after</span> <span style="color: #c678dd;">:before</span>) #',fn))
               ((symbolp ,hook)
                (add-hook ,hook #',fn ,append)))))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">doom-enlist</span> (exp)
  <span style="color: #83898d;">"Return EXP wrapped in a list, or as-is if already a list."</span>
  (<span style="color: #51afef;">if</span> (listp exp) exp (list exp)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">doom-unquote</span> (exp)
  <span style="color: #83898d;">"Return EXP unquoted."</span>
  (<span style="color: #51afef;">while</span> (memq (car-safe exp) '(<span style="color: #51afef;">quote</span> function))
    (<span style="color: #51afef;">setq</span> exp (cadr exp)))
  exp)



(<span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">add-hook!</span> (<span style="color: #ECBE7B;">&amp;rest</span> args)
  <span style="color: #83898d;">"A convenience macro for `</span><span style="color: #a9a1e1;">add-hook</span><span style="color: #83898d;">'. Takes, in order:</span>

<span style="color: #83898d;">    1. Optional properties :local and/or :append, which will make the hook</span>
<span style="color: #83898d;">       buffer-local or append to the list of hooks (respectively),</span>
<span style="color: #83898d;">    2. The hooks: either an unquoted major mode, an unquoted list of major-modes,</span>
<span style="color: #83898d;">       a quoted hook variable or a quoted list of hook variables. If unquoted, the</span>
<span style="color: #83898d;">       hooks will be resolved by appending -hook to each symbol.</span>
<span style="color: #83898d;">    3. A function, list of functions, or body forms to be wrapped in a lambda.</span>

<span style="color: #83898d;">  Examples:</span>
<span style="color: #83898d;">      (add-hook! 'some-mode-hook 'enable-something)</span>
<span style="color: #83898d;">      (add-hook! some-mode '(enable-something and-another))</span>
<span style="color: #83898d;">      (add-hook! '(one-mode-hook second-mode-hook) 'enable-something)</span>
<span style="color: #83898d;">      (add-hook! (one-mode second-mode) 'enable-something)</span>
<span style="color: #83898d;">      (add-hook! :append (one-mode second-mode) 'enable-something)</span>
<span style="color: #83898d;">      (add-hook! :local (one-mode second-mode) 'enable-something)</span>
<span style="color: #83898d;">      (add-hook! (one-mode second-mode) (setq v 5) (setq a 2))</span>
<span style="color: #83898d;">      (add-hook! :append :local (one-mode second-mode) (setq v 5) (setq a 2))</span>

<span style="color: #83898d;">  Body forms can access the hook's arguments through the let-bound variable</span>
<span style="color: #83898d;">  `</span><span style="color: #a9a1e1;">args</span><span style="color: #83898d;">'."</span>
  (<span style="color: #51afef;">declare</span> (indent defun) (debug t))
  (<span style="color: #51afef;">let</span> ((hook-fn 'add-hook)
        append-p local-p)
    (<span style="color: #51afef;">while</span> (keywordp (car args))
      (<span style="color: #51afef;">pcase</span> (<span style="color: #51afef;">pop</span> args)
        (<span style="color: #c678dd;">:append</span> (<span style="color: #51afef;">setq</span> append-p t))
        (<span style="color: #c678dd;">:local</span>  (<span style="color: #51afef;">setq</span> local-p t))
        (<span style="color: #c678dd;">:remove</span> (<span style="color: #51afef;">setq</span> hook-fn 'remove-hook))))
    (<span style="color: #51afef;">let</span> ((hooks (my/resolve-hook-forms (<span style="color: #51afef;">pop</span> args)))
          (funcs
           (<span style="color: #51afef;">let</span> ((val (car args)))
             (<span style="color: #51afef;">if</span> (memq (car-safe val) '(<span style="color: #51afef;">quote</span> function))
                 (<span style="color: #51afef;">if</span> (cdr-safe (cadr val))
                     (cadr val)
                   (list (cadr val)))
               (list args))))
          forms)
      (<span style="color: #51afef;">dolist</span> (fn funcs)
        (<span style="color: #51afef;">setq</span> fn (<span style="color: #51afef;">if</span> (symbolp fn)
                     `(<span style="color: #51afef;">function</span> ,fn)
                   `(<span style="color: #51afef;">lambda</span> (<span style="color: #ECBE7B;">&amp;rest</span> _) ,@args)))
        (<span style="color: #51afef;">dolist</span> (hook hooks)
          (<span style="color: #51afef;">push</span> (<span style="color: #51afef;">cond</span> ((eq hook-fn 'remove-hook)
                       `(remove-hook ',hook ,fn ,local-p))
                      (t
                       `(add-hook ',hook ,fn ,append-p ,local-p)))
                forms)))
      `(<span style="color: #51afef;">progn</span> ,@(nreverse forms)))))

(<span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">remove-hook!</span> (<span style="color: #ECBE7B;">&amp;rest</span> args)
  <span style="color: #83898d;">"Convenience macro for `</span><span style="color: #a9a1e1;">remove-hook</span><span style="color: #83898d;">'. Takes the same arguments as</span>
<span style="color: #83898d;">  `</span><span style="color: #a9a1e1;">add-hook!</span><span style="color: #83898d;">'."</span>
  `(<span style="color: #51afef;">add-hook!</span> <span style="color: #c678dd;">:remove</span> ,@args))

</pre>
</div>
</div>
</div>
