config.org
**** packages
***** async
  #+BEGIN_SRC emacs-lisp
(use-package async :demand t
  :config
  (dired-async-mode 1))
  #+END_SRC
***** subr-x
  #+BEGIN_SRC emacs-lisp
(use-package subr-x :demand t :ensure nil)

  #+END_SRC

***** dash
  #+BEGIN_SRC emacs-lisp
(use-package dash
  :ensure t
  :config
  (dash-enable-font-lock))
(use-package dash-functional
  :ensure t)
  #+END_SRC

***** f
  #+BEGIN_SRC emacs-lisp
(use-package f
  :ensure t)
  #+END_SRC

***** s
   #+BEGIN_SRC emacs-lisp
(use-package s
  :ensure t)
   #+END_SRC

***** ht
   #+BEGIN_SRC emacs-lisp
(use-package ht
  :ensure t)
   #+END_SRC

***** a
  #+begin_src emacs-lisp
(require 'let-alist)
(use-package a
  :ensure t)
  #+end_src

***** persistent-soft
  #+BEGIN_SRC emacs-lisp
(use-package persistent-soft
  :ensure t)
  #+END_SRC

***** request
  #+BEGIN_SRC emacs-lisp
(use-package request :ensure t)
  #+END_SRC
*** Linux
   #+BEGIN_SRC emacs-lisp
(use-package gpastel
  :if (eq system-type 'gnu/linux)
  :hook (exwm-init . gpastel-mode))

(use-package exec-path-from-shell
  :if (eq system-type 'gnu/linux)
  :config
  (exec-path-from-shell-initialize))

(use-package counsel
  :if (eq system-type 'gnu/linux)
  :config
  (push (concat (getenv "HOME") "/.local/share/applications/") counsel-linux-apps-directories)
  (defun my/counsel-linux-app-format-function (name comment exec)
    "Default Linux application name formatter.
   NAME is the name of the application, COMMENT its comment and EXEC
   the command to launch it."
    (format "% -45s %s"
            (propertize name 'face 'font-lock-builtin-face)
            (or comment "")))
  (setq counsel-linux-app-format-function #'my/counsel-linux-app-format-function)

  (setq x-gtk-use-system-tooltips nil))

(use-package desktop-environment
  :if (eq system-type 'gnu/linux)
  :commands (desktop-environment-mode)
  :config
  (progn
    (unbind-key "s-l" desktop-environment-mode-map)
    (desktop-environment-mode)))

(menu-bar-mode -1)
  #+END_SRC

