index.html
<div id="outline-container-org3eebfe8" class="outline-4">
<h4 id="org3eebfe8"><span class="section-number-4">1.2.2</span> packages</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org7d55c6c"></a>async<br />
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">async</span> <span style="color: #c678dd;">:demand</span> t
  <span style="color: #c678dd;">:config</span>
  (dired-async-mode 1))
</pre>
</div>
</div>
</li>
<li><a id="org29a0df6"></a>subr-x<br />
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">subr-x</span> <span style="color: #c678dd;">:demand</span> t <span style="color: #c678dd;">:ensure</span> nil)

</pre>
</div>
</div>
</li>

<li><a id="org3f0c10d"></a>dash<br />
<div class="outline-text-5" id="text-1-2-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dash</span>
  <span style="color: #c678dd;">:ensure</span> t
  <span style="color: #c678dd;">:config</span>
  (dash-enable-font-lock))
(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dash-functional</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org374b05e"></a>f<br />
<div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">f</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org5fc0fa6"></a>s<br />
<div class="outline-text-5" id="text-1-2-2-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">s</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org562116a"></a>ht<br />
<div class="outline-text-5" id="text-1-2-2-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ht</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org574392f"></a>a<br />
<div class="outline-text-5" id="text-1-2-2-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">let-alist</span>)
(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">a</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org61161b3"></a>persistent-soft<br />
<div class="outline-text-5" id="text-1-2-2-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">persistent-soft</span>
  <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>

<li><a id="org97e00b9"></a>request<br />
<div class="outline-text-5" id="text-1-2-2-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">request</span> <span style="color: #c678dd;">:ensure</span> t)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgbf109d5" class="outline-3">
<h3 id="orgbf109d5"><span class="section-number-3">1.3</span> Linux</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">gpastel</span>
  <span style="color: #c678dd;">:if</span> (eq system-type 'gnu/linux))

(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">exec-path-from-shell</span>
  <span style="color: #c678dd;">:if</span> (eq system-type 'gnu/linux)
  <span style="color: #c678dd;">:config</span>
  (exec-path-from-shell-initialize))

(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">counsel</span>
  <span style="color: #c678dd;">:if</span> (eq system-type 'gnu/linux)
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">push</span> (concat (getenv <span style="color: #98be65;">"HOME"</span>) <span style="color: #98be65;">"/.local/share/applications/"</span>) counsel-linux-apps-directories)
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/counsel-linux-app-format-function</span> (name comment exec)
    <span style="color: #83898d;">"Default Linux application name formatter.</span>
<span style="color: #83898d;">   NAME is the name of the application, COMMENT its comment and EXEC</span>
<span style="color: #83898d;">   the command to launch it."</span>
    (format <span style="color: #98be65;">"% -45s %s"</span>
            (propertize name 'face 'font-lock-builtin-face)
            (<span style="color: #51afef;">or</span> comment <span style="color: #98be65;">""</span>)))
  (<span style="color: #51afef;">setq</span> counsel-linux-app-format-function #'my/counsel-linux-app-format-function)

  (<span style="color: #51afef;">setq</span> x-gtk-use-system-tooltips nil))

(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">desktop-environment</span>
  <span style="color: #c678dd;">:if</span> (eq system-type 'gnu/linux)
  <span style="color: #c678dd;">:commands</span> (desktop-environment-mode)
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">progn</span>
    (<span style="color: #51afef;">unbind-key</span> <span style="color: #98be65;">"s-l"</span> desktop-environment-mode-map)
    (desktop-environment-mode)))

</pre>
</div>
</div>
</div>
