config.org
*** DISABLED macOS
   #+BEGIN_SRC emacs-lisp
(if (eq system-type 'darwin)
    (set-face-attribute 'default nil
                        :family "Hack Nerd Font"
                        :height 120
                        :weight 'normal
                        :width 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      :slant 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      :slant 'Italic))


(if (eq system-type 'darwin)

    (use-package exec-path-from-shell
      :config
      (exec-path-from-shell-initialize))

  (use-package pbcopy
    :ensure t)

  (paradox-require 'exec-path-from-shell)

  (setq ns-function-modifier 'hyper)

  (defun user-swap-meta-and-super ()
    "Swap the mapping of Meta and Super.
 Very useful for people using their Mac with a
 Windows external keyboard from time to time."
    (interactive)
    (if (eq mac-command-modifier 'super)
        (progn
          (setq mac-command-modifier 'meta)
          (setq mac-option-modifier 'super)
          (message "Command is now bound to META and Option is bound to SUPER."))
      (setq mac-command-modifier 'super)
      (setq mac-option-modifier 'meta)
      (message "Command is now bound to SUPER and Option is bound to META.")))

  (menu-bar-mode +1)

  (when (fboundp 'set-fontset-font)
    (set-fontset-font t 'unicode "Apple Color Emoji" nil 'prepend))

  (setq locate-make-command-line (lambda (s) `("mdfind" "-name" ,s)))

  (setq mac-emulate-three-button-mouse t)

  (setq shift-select-mode t)

  (global-set-key (kbd "<s-up>")    'beginning-of-buffer)
  (global-set-key (kbd "<s-down>")  'end-of-buffer)
  (global-set-key (kbd "<s-left>")  'move-beginning-of-line)
  (global-set-key (kbd "<s-right>") 'move-end-of-line)

  (define-key global-map (kbd "s-+") 'text-scale-increase)
  (define-key global-map (kbd "s--") 'text-scale-decrease)

  (global-set-key (kbd "s-f") 'isearch-forward-regexp)

  (global-set-key (kbd "<M-up>") 'backward-paragraph)
  (global-set-key (kbd "<M-down>") 'forward-paragraph)

  (global-set-key (kbd "M-<backspace>") 'backward-kill-word)

  (global-set-key (kbd "C-x K") 'kill-this-buffer)

  (setq delete-by-moving-to-trash t)

  (setq ns-right-alternate-modifier nil)

  (setq mac-option-modifier 'meta)
  (setq mac-command-modifier 'super)

  (global-set-key [(super a)] 'mark-whole-buffer)
  (global-set-key [(super c)] 'kill-ring-save)
  (global-set-key [(super g)] 'isearch-repeat-forward)
  (global-set-key [(super l)] 'goto-line)
  (global-set-key [(super q)] 'save-buffers-kill-terminal)
  (global-set-key [(super s)] 'save-buffer)
  (global-set-key [(super v)] 'yank)
  (global-set-key [(super x)] 'kill-region)
  (global-set-key [(super w)] (lambda ()
                                (interactive)
                                (kill-buffer (current-buffer))))
  (global-set-key [(super z)] 'undo)

  (setq visible-bell nil)

  (setq mac-right-alternate-modifier nil)

  (global-set-key (kbd "s-K") nil)
  (global-set-key (kbd "s-k") nil)
  (add-hook 'prog-mode-hook
            (lambda ()
              ;; compile short cuts
              (define-key (current-local-map) (kbd "s-K") 'compile)
              (define-key (current-local-map) (kbd "s-k") 'recompile)))

  (defun my/open-finder-at (path)
    "Open Finder app with the given PATH."
    (let* ((finder (executable-find "open"))
           (command (format "%s %s" finder path)))
      (shell-command command)))

  (defun my/open-project-in-finder ()
    "Open current project in Finder app."
    (interactive)
    (if (projectile-project-p)
        (my/open-finder-at (projectile-project-root))
      (message "There is no active project.")))

  (defun my/open-current-file-in-finder ()
    "Open current file in Finder."
    (interactive)
    (let ((file (buffer-file-name)))
      (if file
          (my/open-finder-at (file-name-directory file))
        (message "Buffer has not been saved yet!"))))

  )



    #+END_SRC
** Modules
