index.html

<div id="outline-container-orgee3e923" class="outline-3">
<h3 id="orgee3e923"><span class="section-number-3">1.4</span> macOS</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">if</span> (eq system-type 'gnu/linux)
    (set-face-attribute 'default nil
                        <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Hack Nerd Font"</span>
                        <span style="color: #c678dd;">:height</span> 120
                        <span style="color: #c678dd;">:weight</span> 'normal
                        <span style="color: #c678dd;">:width</span> 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      <span style="color: #c678dd;">:slant</span> 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      <span style="color: #c678dd;">:slant</span> 'Italic))


(<span style="color: #51afef;">if</span> (eq system-type 'darwin)

    (<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">exec-path-from-shell</span>
      <span style="color: #c678dd;">:config</span>
      (exec-path-from-shell-initialize))

  (<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">pbcopy</span>
    <span style="color: #c678dd;">:ensure</span> t)

  (paradox-require 'exec-path-from-shell)

  (<span style="color: #51afef;">setq</span> ns-function-modifier 'hyper)

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">user-swap-meta-and-super</span> ()
    <span style="color: #83898d;">"Swap the mapping of Meta and Super.</span>
<span style="color: #83898d;"> Very useful for people using their Mac with a</span>
<span style="color: #83898d;"> Windows external keyboard from time to time."</span>
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">if</span> (eq mac-command-modifier 'super)
        (<span style="color: #51afef;">progn</span>
          (<span style="color: #51afef;">setq</span> mac-command-modifier 'meta)
          (<span style="color: #51afef;">setq</span> mac-option-modifier 'super)
          (message <span style="color: #98be65;">"Command is now bound to META and Option is bound to SUPER."</span>))
      (<span style="color: #51afef;">setq</span> mac-command-modifier 'super)
      (<span style="color: #51afef;">setq</span> mac-option-modifier 'meta)
      (message <span style="color: #98be65;">"Command is now bound to SUPER and Option is bound to META."</span>)))

  (menu-bar-mode +1)

  (<span style="color: #51afef;">when</span> (fboundp 'set-fontset-font)
    (set-fontset-font t 'unicode <span style="color: #98be65;">"Apple Color Emoji"</span> nil 'prepend))

  (<span style="color: #51afef;">setq</span> locate-make-command-line (<span style="color: #51afef;">lambda</span> (s) `(<span style="color: #98be65;">"mdfind"</span> <span style="color: #98be65;">"-name"</span> ,s)))

  (<span style="color: #51afef;">setq</span> mac-emulate-three-button-mouse t)

  (<span style="color: #51afef;">setq</span> shift-select-mode t)

  (global-set-key (kbd <span style="color: #98be65;">"&lt;s-up&gt;"</span>)    'beginning-of-buffer)
  (global-set-key (kbd <span style="color: #98be65;">"&lt;s-down&gt;"</span>)  'end-of-buffer)
  (global-set-key (kbd <span style="color: #98be65;">"&lt;s-left&gt;"</span>)  'move-beginning-of-line)
  (global-set-key (kbd <span style="color: #98be65;">"&lt;s-right&gt;"</span>) 'move-end-of-line)

  (define-key global-map (kbd <span style="color: #98be65;">"s-+"</span>) 'text-scale-increase)
  (define-key global-map (kbd <span style="color: #98be65;">"s--"</span>) 'text-scale-decrease)

  (global-set-key (kbd <span style="color: #98be65;">"s-f"</span>) 'isearch-forward-regexp)

  (global-set-key (kbd <span style="color: #98be65;">"&lt;M-up&gt;"</span>) 'backward-paragraph)
  (global-set-key (kbd <span style="color: #98be65;">"&lt;M-down&gt;"</span>) 'forward-paragraph)

  (global-set-key (kbd <span style="color: #98be65;">"M-&lt;backspace&gt;"</span>) 'backward-kill-word)

  (global-set-key (kbd <span style="color: #98be65;">"C-x K"</span>) 'kill-this-buffer)

  (<span style="color: #51afef;">setq</span> delete-by-moving-to-trash t)

  (<span style="color: #51afef;">setq</span> ns-right-alternate-modifier nil)

  (<span style="color: #51afef;">setq</span> mac-option-modifier 'meta)
  (<span style="color: #51afef;">setq</span> mac-command-modifier 'super)

  (global-set-key [(super a)] 'mark-whole-buffer)
  (global-set-key [(super c)] 'kill-ring-save)
  (global-set-key [(super g)] 'isearch-repeat-forward)
  (global-set-key [(super l)] 'goto-line)
  (global-set-key [(super q)] 'save-buffers-kill-terminal)
  (global-set-key [(super s)] 'save-buffer)
  (global-set-key [(super v)] 'yank)
  (global-set-key [(super x)] 'kill-region)
  (global-set-key [(super w)] (<span style="color: #51afef;">lambda</span> ()
                                (<span style="color: #51afef;">interactive</span>)
                                (kill-buffer (current-buffer))))
  (global-set-key [(super z)] 'undo)

  (<span style="color: #51afef;">setq</span> visible-bell nil)

  (<span style="color: #51afef;">setq</span> mac-right-alternate-modifier nil)

  (global-set-key (kbd <span style="color: #98be65;">"s-K"</span>) nil)
  (global-set-key (kbd <span style="color: #98be65;">"s-k"</span>) nil)
  (add-hook 'prog-mode-hook
            (<span style="color: #51afef;">lambda</span> ()
              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">compile short cuts</span>
              (define-key (current-local-map) (kbd <span style="color: #98be65;">"s-K"</span>) 'compile)
              (define-key (current-local-map) (kbd <span style="color: #98be65;">"s-k"</span>) 'recompile)))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/open-finder-at</span> (path)
    <span style="color: #83898d;">"Open Finder app with the given PATH."</span>
    (<span style="color: #51afef;">let*</span> ((finder (executable-find <span style="color: #98be65;">"open"</span>))
           (command (format <span style="color: #98be65;">"%s %s"</span> finder path)))
      (shell-command command)))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/open-project-in-finder</span> ()
    <span style="color: #83898d;">"Open current project in Finder app."</span>
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">if</span> (projectile-project-p)
        (my/open-finder-at (projectile-project-root))
      (message <span style="color: #98be65;">"There is no active project."</span>)))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/open-current-file-in-finder</span> ()
    <span style="color: #83898d;">"Open current file in Finder."</span>
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">let</span> ((file (buffer-file-name)))
      (<span style="color: #51afef;">if</span> file
          (my/open-finder-at (file-name-directory file))
        (message <span style="color: #98be65;">"Buffer has not been saved yet!"</span>))))

  )



</pre>
</div>
</div>
</div>
</div>
