index.html
<div id="outline-container-org7ef104f" class="outline-2">
<h2 id="org7ef104f"><span class="section-number-2">2</span> Modules</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2c47e8f" class="outline-3">
<h3 id="org2c47e8f"><span class="section-number-3">2.1</span> General</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> savehist-file (concat dotfiles-cache-dir <span style="color: #98be65;">"savehist"</span>)
      history-length 500
      savehist-save-minibuffer-history t
      savehist-autosave-interval nil <span style="color: #5B6268;">; </span><span style="color: #5B6268;">save on kill only</span>
      savehist-additional-variables '(kill-ring search-ring regexp-search-ring)
      save-place-file (concat dotfiles-cache-dir <span style="color: #98be65;">"saveplace"</span>))

(<span style="color: #51afef;">setq-default</span> save-place t)



(add-to-list 'default-frame-alist '(inhibit-double-buffering . t))

(<span style="color: #51afef;">setq</span> byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

(<span style="color: #51afef;">setq</span> undo-limit (* 1024 10 10)
      undo-outer-limit (* 1024 10 10)
      undo-strong-limit (* 1024 10 10))


(<span style="color: #51afef;">setq-default</span>
 bookmark-default-file         (concat dotfiles-cache-dir <span style="color: #98be65;">"bookmarks"</span>)
 abbrev-file-name             (concat dotfiles-local-dir <span style="color: #98be65;">"abbrev.el"</span>)
 auto-save-list-file-name     (concat dotfiles-cache-dir <span style="color: #98be65;">"autosave"</span>)
 pcache-directory             (concat dotfiles-cache-dir <span style="color: #98be65;">"pcache"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">move auto-save to the cache</span>
(<span style="color: #51afef;">let</span> ((dir (expand-file-name (concat dotfiles-cache-dir <span style="color: #98be65;">"auto-save/"</span>))))
  (<span style="color: #51afef;">setq</span> auto-save-list-file-prefix (concat dir <span style="color: #98be65;">"saves-"</span>))
  (<span style="color: #51afef;">setq</span> auto-save-file-name-transforms `((<span style="color: #98be65;">".*"</span> ,(concat dir <span style="color: #98be65;">"save-"</span>) t))))

(<span style="color: #51afef;">setq</span> help-window-select t)

(<span style="color: #51afef;">setq-default</span>
 ad-redefinition-action 'accept          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">silence advised function warnings</span>
 apropos-do-all t                        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">make `</span><span style="color: #a9a1e1;">apropos</span><span style="color: #5B6268;">' more useful</span>
 compilation-always-kill t               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">kill compilation process before starting another</span>
 compilation-ask-about-save nil          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">save all buffers on `</span><span style="color: #a9a1e1;">compile</span><span style="color: #5B6268;">'</span>
 compilation-scroll-output t             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">scroll to end of compilation output</span>
 confirm-nonexistent-file-or-buffer t    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">confirm nonexisting files/buffers when opening</span>
 idle-update-delay 2                     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">update ui less often (performance)</span>
 warning-minimum-level <span style="color: #c678dd;">:error</span>            <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't show warnings only errors</span>
 <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">keep the point out of the minibuffer</span>
 minibuffer-prompt-properties '(read-only t point-entered minibuffer-avoid-prompt face minibuffer-prompt))

(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(load-library <span style="color: #98be65;">"iso-transl"</span>)


(<span style="color: #51afef;">setq-default</span>
 isearch-allow-scroll t                 <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Allow scrolling in an isearch session</span>
 lazy-highlight-cleanup nil             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Leave highlights after an isearch session</span>
 lazy-highlight-initial-delay 0)        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Start highlighting immediately</span>


(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">vc-hooks</span>)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Always follow symlinks to files under source-control. dont ask.</span>
(<span style="color: #51afef;">setq</span> vc-follow-symlinks t)
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Modifications related to whitespace management</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Disable tab indentation</span>
(<span style="color: #51afef;">setq-default</span> indent-tabs-mode nil)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Remove trailing whitespace before save.</span>
(add-hook 'before-save-hook 'delete-trailing-whitespace)

(<span style="color: #51afef;">setq</span>
 auto-save-default nil
 backup-inhibited t
 confirm-nonexistent-file-or-buffer nil
 create-lockfiles nil
 mouse-wheel-progressive-speed nil)


(define-key global-map [remap list-buffers] 'ibuffer)



(winner-mode +1)



(global-set-key (kbd <span style="color: #98be65;">"C-x C-c"</span>) 'save-buffers-kill-emacs)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Always ask for y/n keypress instead of typing out 'yes' or 'no'</span>
(autoload 'ibuffer <span style="color: #98be65;">"ibuffer"</span>)

(fset 'yes-or-no-p 'y-or-n-p)


<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Emacs writes backup files to `filename~` by default. This is messy,</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">so let's tell it to write them to `~/.emacs.d/bak` instead.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">If you have an accident, check this directory - you might get lucky.</span>
(<span style="color: #51afef;">setq</span> backup-directory-alist   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Save backups in $(pwd)/.bak</span>
      '((<span style="color: #98be65;">"."</span> . <span style="color: #98be65;">".bak"</span>))        <span style="color: #5B6268;">;;</span>
      )

(<span style="color: #51afef;">setq</span> version-control t
      backup-by-copying t      <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Copy-on-write-esque</span>
      kept-new-versions 64     <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Indeliable-ink-esque</span>
      kept-old-versions 0      <span style="color: #5B6268;">;;</span>
      delete-old-versions t    <span style="color: #5B6268;">;;</span>
      )



<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Automatically save buffers before launching M-x compile and friends,</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">instead of asking you if you want to save.</span>
(<span style="color: #51afef;">setq</span> compilation-ask-about-save nil)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Make the selection work like most people expect.</span>
(delete-selection-mode 1)
(transient-mark-mode t)

(global-set-key (kbd <span style="color: #98be65;">"DEL"</span>) 'backward-delete-char)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Enable `</span><span style="color: #a9a1e1;">downcase-region</span><span style="color: #5B6268;">' and `</span><span style="color: #a9a1e1;">upcase-region</span><span style="color: #5B6268;">'</span>
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)


<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Automatically update unmodified buffers whose files have changed.</span>
(global-auto-revert-mode 1)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">If available, use `</span><span style="color: #a9a1e1;">xdg-open</span><span style="color: #5B6268;">' to open URLs.</span>
(<span style="color: #51afef;">when</span> (core/is-exec <span style="color: #98be65;">"xdg-open"</span>)
  (<span style="color: #51afef;">setq-default</span>
   browse-url-browser-function (<span style="color: #51afef;">quote</span> browse-url-generic)
   browse-url-generic-program <span style="color: #98be65;">"xdg-open"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Make compilation buffers scroll to follow the output, but stop scrolling</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">at the first error.</span>
(<span style="color: #51afef;">setq</span> compilation-scroll-output 'first-error)

(<span style="color: #51afef;">setq-default</span> uniquify-buffer-name-style 'forward)

(global-set-key <span style="color: #98be65;">"\C-C\C-e"</span> 'eval-buffer)


(global-unset-key [(control z)])
(global-unset-key [(control x)(control z)])
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f1&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f2&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f3&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f4&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f5&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f6&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f7&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f8&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f9&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f10&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f11&gt;"</span>))
(global-unset-key (kbd <span style="color: #98be65;">"&lt;f12&gt;"</span>))

(<span style="color: #51afef;">dotimes</span> (n 10)
  (global-unset-key (kbd (format <span style="color: #98be65;">"C-%d"</span> n)))
  (global-unset-key (kbd (format <span style="color: #98be65;">"M-%d"</span> n)))
  )

</pre>
</div>
</div>
</div>
