config.org
*** Appearance
**** config
   #+BEGIN_SRC emacs-lisp
(if (eq system-type 'gnu/linux)
    (set-face-attribute 'default nil
                        :family "Source Code Pro"
                        :height 105
                        :weight 'normal
                        :width 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      :slant 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      :slant 'Italic))

(if (eq system-type 'darwin)
    (set-face-attribute 'default nil
                        :family "Hack Nerd Font"
                        :height 120
                        :weight 'normal
                        :width 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      :slant 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      :slant 'Italic))


(defun module-fonts/spec-to-list (spec)
  (s-split "-" spec))

(defun module-fonts/list-to-spec (spec)
  (s-join "-" spec))

(defun module-fonts/update-font-spec-size (spec increment)
  (module-fonts/list-to-spec
   (-update-at 7 (lambda (i) (number-to-string
                              (+ (string-to-number i) increment)))
               (module-fonts/spec-to-list spec))))

(defun module-fonts/update-font-size (increment)
  (set-frame-font
   (module-fonts/update-font-spec-size (frame-parameter nil 'font) increment)))

(global-set-key (kbd "C-M--") (lambda () (interactive)
                                (module-fonts/update-font-size -1)))
(global-set-key (kbd "C-M-=") (lambda () (interactive)
                                (module-fonts/update-font-size 1)))

(require 'term)

;; Don't defer screen updates when performing operations.
(setq redisplay-dont-pause t)

;; When not in a terminal, configure a few window system specific things.
(when window-system
  (setq frame-title-format '(buffer-file-name "%f" ("%b")))
  (tooltip-mode -1)
  (mouse-wheel-mode t)
  (blink-cursor-mode -1))

;; Show line numbers in buffers.
(global-linum-mode -1)
(setq linum-format (if (not window-system) "%4d " "%4d"))

;; Show column numbers in modeline.
(setq column-number-mode t)

;; Show current function in modeline.
(which-function-mode)

;; Ensure linum-mode is disabled in certain major modes.
(setq linum-disabled-modes
      '(term-mode slime-repl-mode magit-status-mode help-mode nrepl-mode
                  mu4e-main-mode mu4e-headers-mode mu4e-view-mode
                  mu4e-compose-mode))
(defun linum-on ()
  (unless (or (minibufferp) (member major-mode linum-disabled-modes))
    (linum-mode 1)))

;; Highlight matching braces.
(show-paren-mode 1)

;; Handle ANSI colours in compile buffer output.
;; From https://gist.github.com/jwiegley/8ae7145ba5ce64250a05
(defun compilation-ansi-color-process-output ()
  (ansi-color-process-output nil)
  (set (make-local-variable 'comint-last-output-start)
       (point-marker)))
(add-hook 'compilation-filter-hook #'compilation-ansi-color-process-output)

(setq-default
 bidi-display-reordering nil         ; disable bidirectional text for tiny performance boost
 blink-matching-paren nil            ; don't blink--too distracting
 cursor-in-non-selected-windows nil  ; hide cursors in other windows
 display-line-numbers-width 3        ; minimum width used to display line numbers
 frame-inhibit-implied-resize t      ; prevent frames from automatically resizing themselves
 highlight-nonselected-windows nil   ; don't highlight selections in other windows
 fringe-indicator-alist (delq (assq 'continuation fringe-indicator-alist) fringe-indicator-alist)
 indicate-buffer-boundaries nil      ; don't indicate beginning and end of buffer in fringe
 indicate-empty-lines nil            ; don't indicate empty lines in fringe
 max-mini-window-height 0.3          ; maximum height for resizing mini windows
 mode-line-default-help-echo nil     ; disable mode-line mouseovers
 mouse-yank-at-point t               ; middle-click paste at point, not at click
 resize-mini-windows 'grow-only      ; Minibuffer resizing
 show-help-function nil              ; hide :help-echo text
 split-width-threshold 160           ; favor horizontal splits
 use-dialog-box nil                  ; always avoid GUI
 visible-cursor nil                  ; don't make cursor 'very visible'
 x-stretch-cursor nil                ; don't add wide glyph under cursor
 sentence-end-double-space nil
 mark-ring-max 64
 global-mark-ring-max 128
 save-interprogram-paste-before-kill t
 create-lockfiles nil
 echo-keystrokes 0.01
 global-hl-line-mode t


; jit-lock-defer-time nil             ; defer jit font locking slightly to [try to] improve Emacs performance
; jit-lock-stealth-nice 0.5           ; pause time between fontify chunks
; jit-lock-stealth-time 1             ; time to wait before start of stealth fontify
; jit-lock-stealth-verbose nil        ; silence stealth fontification
 ;; `pos-tip' defaults
 pos-tip-internal-border-width 6     ; increase pos-tip width
 pos-tip-border-width 1              ; define border width
 ;; no beeping or blinking please
 ring-bell-function #'ignore         ; don't beep
 visible-bell nil)                   ; don't blink

      #+END_SRC

**** Icons
