index.html
<div id="outline-container-orgfac11db" class="outline-3">
<h3 id="orgfac11db"><span class="section-number-3">2.2</span> Appearance</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org33b659f" class="outline-4">
<h4 id="org33b659f"><span class="section-number-4">2.2.1</span> config</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">if</span> (eq system-type 'gnu/linux)
    (set-face-attribute 'default nil
                        <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Source Code Pro"</span>
                        <span style="color: #c678dd;">:height</span> 105
                        <span style="color: #c678dd;">:weight</span> 'normal
                        <span style="color: #c678dd;">:width</span> 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      <span style="color: #c678dd;">:slant</span> 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      <span style="color: #c678dd;">:slant</span> 'Italic))

(<span style="color: #51afef;">if</span> (eq system-type 'darwin)
    (set-face-attribute 'default nil
                        <span style="color: #c678dd;">:family</span> <span style="color: #98be65;">"Hack Nerd Font"</span>
                        <span style="color: #c678dd;">:height</span> 120
                        <span style="color: #c678dd;">:weight</span> 'normal
                        <span style="color: #c678dd;">:width</span> 'normal
                        )
  (set-face-attribute 'Info-quoted nil
                      <span style="color: #c678dd;">:slant</span> 'Italic)
  (set-face-attribute 'font-lock-string-face nil
                      <span style="color: #c678dd;">:slant</span> 'Italic))


(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module-fonts/spec-to-list</span> (spec)
  (s-split <span style="color: #98be65;">"-"</span> spec))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module-fonts/list-to-spec</span> (spec)
  (s-join <span style="color: #98be65;">"-"</span> spec))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module-fonts/update-font-spec-size</span> (spec increment)
  (module-fonts/list-to-spec
   (<span style="color: #51afef;">-update-at</span> 7 (<span style="color: #51afef;">lambda</span> (i) (number-to-string
                              (+ (string-to-number i) increment)))
               (module-fonts/spec-to-list spec))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module-fonts/update-font-size</span> (increment)
  (set-frame-font
   (module-fonts/update-font-spec-size (frame-parameter nil 'font) increment)))

(global-set-key (kbd <span style="color: #98be65;">"C-M--"</span>) (<span style="color: #51afef;">lambda</span> () (<span style="color: #51afef;">interactive</span>)
                                (module-fonts/update-font-size -1)))
(global-set-key (kbd <span style="color: #98be65;">"C-M-="</span>) (<span style="color: #51afef;">lambda</span> () (<span style="color: #51afef;">interactive</span>)
                                (module-fonts/update-font-size 1)))

(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">term</span>)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Don't defer screen updates when performing operations.</span>
(<span style="color: #51afef;">setq</span> redisplay-dont-pause t)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">When not in a terminal, configure a few window system specific things.</span>
(<span style="color: #51afef;">when</span> window-system
  (<span style="color: #51afef;">setq</span> frame-title-format '(buffer-file-name <span style="color: #98be65;">"%f"</span> (<span style="color: #98be65;">"%b"</span>)))
  (tooltip-mode -1)
  (mouse-wheel-mode t)
  (blink-cursor-mode -1))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Show line numbers in buffers.</span>
(global-linum-mode -1)
(<span style="color: #51afef;">setq</span> linum-format (<span style="color: #51afef;">if</span> (not window-system) <span style="color: #98be65;">"%4d "</span> <span style="color: #98be65;">"%4d"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Show column numbers in modeline.</span>
(<span style="color: #51afef;">setq</span> column-number-mode t)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Show current function in modeline.</span>
(which-function-mode)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Ensure linum-mode is disabled in certain major modes.</span>
(<span style="color: #51afef;">setq</span> linum-disabled-modes
      '(term-mode slime-repl-mode magit-status-mode help-mode nrepl-mode
                  mu4e-main-mode mu4e-headers-mode mu4e-view-mode
                  mu4e-compose-mode))
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">linum-on</span> ()
  (<span style="color: #51afef;">unless</span> (<span style="color: #51afef;">or</span> (minibufferp) (member major-mode linum-disabled-modes))
    (linum-mode 1)))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Highlight matching braces.</span>
(show-paren-mode 1)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Handle ANSI colours in compile buffer output.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">From https://gist.github.com/jwiegley/8ae7145ba5ce64250a05</span>
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">compilation-ansi-color-process-output</span> ()
  (ansi-color-process-output nil)
  (set (make-local-variable 'comint-last-output-start)
       (point-marker)))
(add-hook 'compilation-filter-hook #'compilation-ansi-color-process-output)

(<span style="color: #51afef;">setq-default</span>
 bidi-display-reordering nil         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">disable bidirectional text for tiny performance boost</span>
 blink-matching-paren nil            <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't blink--too distracting</span>
 cursor-in-non-selected-windows nil  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">hide cursors in other windows</span>
 display-line-numbers-width 3        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">minimum width used to display line numbers</span>
 frame-inhibit-implied-resize t      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">prevent frames from automatically resizing themselves</span>
 highlight-nonselected-windows nil   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't highlight selections in other windows</span>
 fringe-indicator-alist (delq (assq 'continuation fringe-indicator-alist) fringe-indicator-alist)
 indicate-buffer-boundaries nil      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't indicate beginning and end of buffer in fringe</span>
 indicate-empty-lines nil            <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't indicate empty lines in fringe</span>
 max-mini-window-height 0.3          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">maximum height for resizing mini windows</span>
 mode-line-default-help-echo nil     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">disable mode-line mouseovers</span>
 mouse-yank-at-point t               <span style="color: #5B6268;">; </span><span style="color: #5B6268;">middle-click paste at point, not at click</span>
 resize-mini-windows 'grow-only      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Minibuffer resizing</span>
 show-help-function nil              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">hide :help-echo text</span>
 split-width-threshold 160           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">favor horizontal splits</span>
 use-dialog-box nil                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">always avoid GUI</span>
 visible-cursor nil                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't make cursor 'very visible'</span>
 x-stretch-cursor nil                <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't add wide glyph under cursor</span>
 sentence-end-double-space nil
 mark-ring-max 64
 global-mark-ring-max 128
 save-interprogram-paste-before-kill t
 create-lockfiles nil
 echo-keystrokes 0.01
 global-hl-line-mode t


 jit-lock-defer-time nil             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">defer jit font locking slightly to [try to] improve Emacs performance</span>
 jit-lock-stealth-nice 0.5           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">pause time between fontify chunks</span>
 jit-lock-stealth-time 1             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">time to wait before start of stealth fontify</span>
 jit-lock-stealth-verbose nil        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">silence stealth fontification</span>
 <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">`</span><span style="color: #a9a1e1;">pos-tip</span><span style="color: #5B6268;">' defaults</span>
 pos-tip-internal-border-width 6     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">increase pos-tip width</span>
 pos-tip-border-width 1              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">define border width</span>
 <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">no beeping or blinking please</span>
 ring-bell-function #'ignore         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't beep</span>
 visible-bell nil)                   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't blink</span>

</pre>
</div>
</div>
</div>
