config.org
***** [[https://github.com/domtronn/all-the-icons.el][all-the-icons: Utility for using and formatting various icon fonts.]]

   Currently, this package provides an interface to the following Icon Fonts
   - Atom File Icons,       found at https://atom.io/packages/file-icons
   - FontAwesome Icons,     found at http://fontawesome.io/
   - GitHub Octicons,       found at http://octicons.github.com
   - Material Design Icons, found at http://google.github.io/material-design-icons/
   - Weather Icons,         found at https://erikflowers.github.io/weather-icons/
   - AllTheIcons,           a custom Icon Font maintained as part of this package
    #+BEGIN_SRC emacs-lisp
(use-package all-the-icons)
    #+END_SRC
***** [[https://github.com/asok/all-the-icons-ivy][all-the-icons-ivy: Shows icons while using ivy and counsel]]
   #+BEGIN_SRC emacs-lisp
(use-package all-the-icons-ivy
  :ensure t
  :config
  (all-the-icons-ivy-setup)
  (defun my/*disable-all-the-icons-in-tty (orig-fn &rest args)
    (when (display-graphic-p)
      (apply orig-fn args)))

  (setq all-the-icons-ivy-file-commands
        '(counsel-find-file counsel-file-jump counsel-recentf counsel-projectile-find-file counsel-projectile-find-dir))

  ;; all-the-icons doesn't work in the terminal, so we "disable" it.
  (dolist (fn '(all-the-icons-octicon all-the-icons-material
                                      all-the-icons-faicon all-the-icons-fileicon
                                      all-the-icons-wicon all-the-icons-alltheicon))
    (advice-add fn :around #'my/*disable-all-the-icons-in-tty)))
   #+END_SRC

**** Doom
***** [[https://github.com/hlissner/emacs-doom-themes][doom-themes: an opinionated pack of modern color-themes]]
   #+BEGIN_SRC emacs-lisp
(use-package doom-themes
  :config
  :init
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(if (eq system-type 'gnu/linux)
    (load-theme 'doom-solarized-light))

(if (eq system-type 'darwin)
    (load-theme 'doom-one))

   #+END_SRC
***** [[https://github.com/seagle0128/doom-modeline/tree/6293c63924732f4b5592a8ca580192df2504c159][doom-modeline: A minimal and modern mode-line]]
     #+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :init
  (doom-modeline-mode +1))
     #+END_SRC

**** Discoverability
***** [[https://github.com/justbur/emacs-which-key/tree/ba03e7e5bcbe3f7d95be2cfddd71454151bb98c8][which-key: Display available keybindings in popup]]
    #+BEGIN_SRC emacs-lisp
(use-package which-key
  :init
  (which-key-mode +1)
  :bind ("C-h C-k" . which-key-show-top-level)
  :config
  (setq which-key-sort-order #'which-key-prefix-then-key-order
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-idle-delay 0.0
        which-key-special-keys nil
        which-key-min-display-lines 7)
  (set-face-attribute 'which-key-local-map-description-face nil :weight 'bold)
  (which-key-setup-side-window-bottom))
    #+END_SRC
***** [[https://melpa.org/#/discover-my-major][discover-my-major: Discover key bindings and their meaning for the current Emacs major mode]]
   #+BEGIN_SRC emacs-lisp
(use-package discover-my-major
  :commands (discover-my-major discover-my-mode)
  :bind ("<f1>" . discover-my-major))
   #+END_SRC
