index.html

<div id="outline-container-org6b4704b" class="outline-4">
<h4 id="org6b4704b"><span class="section-number-4">2.2.2</span> Icons</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="orgf8b4eab"></a><a href="https://github.com/domtronn/all-the-icons.el">all-the-icons: Utility for using and formatting various icon fonts.</a><br />
<div class="outline-text-5" id="text-2-2-2-1">
<p>
Currently, this package provides an interface to the following Icon Fonts
</p>
<ul class="org-ul">
<li>Atom File Icons,       found at <a href="https://atom.io/packages/file-icons">https://atom.io/packages/file-icons</a></li>
<li>FontAwesome Icons,     found at <a href="http://fontawesome.io/">http://fontawesome.io/</a></li>
<li>GitHub Octicons,       found at <a href="http://octicons.github.com">http://octicons.github.com</a></li>
<li>Material Design Icons, found at <a href="http://google.github.io/material-design-icons/">http://google.github.io/material-design-icons/</a></li>
<li>Weather Icons,         found at <a href="https://erikflowers.github.io/weather-icons/">https://erikflowers.github.io/weather-icons/</a></li>
<li><p>
AllTheIcons,           a custom Icon Font maintained as part of this package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">all-the-icons</span>)
</pre>
</div></li>
</ul>
</div>
</li>
<li><a id="org4cd8fb1"></a><a href="https://github.com/asok/all-the-icons-ivy">all-the-icons-ivy: Shows icons while using ivy and counsel</a><br />
<div class="outline-text-5" id="text-2-2-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">all-the-icons-ivy</span>
  <span style="color: #c678dd;">:ensure</span> t
  <span style="color: #c678dd;">:config</span>
  (all-the-icons-ivy-setup)
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/*disable-all-the-icons-in-tty</span> (orig-fn <span style="color: #ECBE7B;">&amp;rest</span> args)
    (<span style="color: #51afef;">when</span> (display-graphic-p)
      (apply orig-fn args)))

  (<span style="color: #51afef;">setq</span> all-the-icons-ivy-file-commands
        '(counsel-find-file counsel-file-jump counsel-recentf counsel-projectile-find-file counsel-projectile-find-dir))

  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">all-the-icons doesn't work in the terminal, so we "disable" it.</span>
  (<span style="color: #51afef;">dolist</span> (fn '(all-the-icons-octicon all-the-icons-material
                                      all-the-icons-faicon all-the-icons-fileicon
                                      all-the-icons-wicon all-the-icons-alltheicon))
    (advice-add fn <span style="color: #c678dd;">:around</span> #'my/*disable-all-the-icons-in-tty)))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9e300eb" class="outline-4">
<h4 id="org9e300eb"><span class="section-number-4">2.2.3</span> Doom</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="org8b4d9c3"></a><a href="https://github.com/hlissner/emacs-doom-themes">doom-themes: an opinionated pack of modern color-themes</a><br />
<div class="outline-text-5" id="text-2-2-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">doom-themes</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #c678dd;">:init</span>
  (<span style="color: #51afef;">setq</span> doom-themes-enable-bold t    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">if nil, bold is universally disabled</span>
        doom-themes-enable-italic t) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">if nil, italics is universally disabled</span>

  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Enable flashing mode-line on errors</span>
  (doom-themes-visual-bell-config)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Enable custom neotree theme (all-the-icons must be installed!)</span>
  (doom-themes-neotree-config)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Corrects (and improves) org-mode's native fontification.</span>
  (doom-themes-org-config))

(<span style="color: #51afef;">if</span> (eq system-type 'gnu/linux)
    (load-theme 'doom-solarized-light))

(<span style="color: #51afef;">if</span> (eq system-type 'darwin)
    (load-theme 'doom-one))

</pre>
</div>
</div>
</li>
<li><a id="orgc116902"></a><a href="https://github.com/seagle0128/doom-modeline/tree/6293c63924732f4b5592a8ca580192df2504c159">doom-modeline: A minimal and modern mode-line</a><br />
<div class="outline-text-5" id="text-2-2-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">doom-modeline</span>
  <span style="color: #c678dd;">:init</span>
  (doom-modeline-mode +1))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge689bf2" class="outline-4">
<h4 id="orge689bf2"><span class="section-number-4">2.2.4</span> Discoverability</h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<ol class="org-ol">
<li><a id="orgb4ee517"></a><a href="https://github.com/justbur/emacs-which-key/tree/ba03e7e5bcbe3f7d95be2cfddd71454151bb98c8">which-key: Display available keybindings in popup</a><br />
<div class="outline-text-5" id="text-2-2-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">which-key</span>
  <span style="color: #c678dd;">:init</span>
  (which-key-mode +1)
  <span style="color: #c678dd;">:bind</span> (<span style="color: #98be65;">"C-h C-k"</span> . which-key-show-top-level)
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> which-key-sort-order #'which-key-prefix-then-key-order
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-idle-delay 0.0
        which-key-special-keys nil
        which-key-min-display-lines 7)
  (set-face-attribute 'which-key-local-map-description-face nil <span style="color: #c678dd;">:weight</span> 'bold)
  (which-key-setup-side-window-bottom))
</pre>
</div>
</div>
</li>
<li><a id="org50d5c75"></a><a href="https://melpa.org/#/discover-my-major">discover-my-major: Discover key bindings and their meaning for the current Emacs major mode</a><br />
<div class="outline-text-5" id="text-2-2-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">discover-my-major</span>
  <span style="color: #c678dd;">:commands</span> (discover-my-major discover-my-mode)
  <span style="color: #c678dd;">:bind</span> (<span style="color: #98be65;">"&lt;f1&gt;"</span> . discover-my-major))
</pre>
</div>
</div>
</li>
