index.html
<li><a id="org8521716"></a>Helpful: A better help buffer<br />
<div class="outline-text-5" id="text-2-2-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">helpful</span>
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-h f"</span> . helpful-function)
         (<span style="color: #98be65;">"C-h v"</span> . helpful-variable)
         (<span style="color: #98be65;">"C-h s"</span> . helpful-symbol)
         (<span style="color: #98be65;">"C-h k"</span> . helpful-key)
         (<span style="color: #98be65;">"C-c h f"</span> . helpful-function)
         (<span style="color: #98be65;">"C-c h v"</span> . helpful-variable)
         (<span style="color: #98be65;">"C-c h c"</span> . helpful-command)
         (<span style="color: #98be65;">"C-c h m"</span> . helpful-macro)
         (<span style="color: #98be65;">"&lt;C-tab&gt;"</span> . backward-button)
         <span style="color: #c678dd;">:map</span> helpful-mode-map
         (<span style="color: #98be65;">"M-?"</span> . helpful-at-point)
         (<span style="color: #98be65;">"RET"</span> . helpful-jump-to-org)
         <span style="color: #c678dd;">:map</span> emacs-lisp-mode-map
         (<span style="color: #98be65;">"M-?"</span> . helpful-at-point)
         <span style="color: #c678dd;">:map</span> lisp-interaction-mode-map  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Scratch buffer</span>
         (<span style="color: #98be65;">"M-?"</span> . helpful-at-point))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">helpful-visit-reference</span> ()
    <span style="color: #83898d;">"Go to the reference at point."</span>
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">let*</span> ((sym helpful--sym)
           (path (get-text-property (point) 'helpful-path))
           (pos (get-text-property (point) 'helpful-pos))
           (pos-is-start (get-text-property (point) 'helpful-pos-is-start)))
      (<span style="color: #51afef;">when</span> (<span style="color: #51afef;">and</span> path pos)
        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">If we're looking at a source excerpt, calculate the offset of</span>
        <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">point, so we don't just go the start of the excerpt.</span>
        (<span style="color: #51afef;">when</span> pos-is-start
          (<span style="color: #51afef;">save-excursion</span>
            (<span style="color: #51afef;">let</span> ((offset 0))
              (<span style="color: #51afef;">while</span> (<span style="color: #51afef;">and</span>
                      (get-text-property (point) 'helpful-pos)
                      (not (eobp)))
                (backward-char 1)
                (<span style="color: #51afef;">setq</span> offset (1+ offset)))
              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">On the last iteration we moved outside the source</span>
              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">excerpt, so we overcounted by one character.</span>
              (<span style="color: #51afef;">setq</span> offset (1- offset))

              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Set POS so we go to exactly the place in the source</span>
              <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">code where point was in the helpful excerpt.</span>
              (<span style="color: #51afef;">setq</span> pos (+ pos offset)))))

        (find-file path)
        (<span style="color: #51afef;">when</span> (<span style="color: #51afef;">or</span> (&lt; pos (point-min))
                  (&gt; pos (point-max)))
          (widen))
        (goto-char pos)
        (recenter 0)
        (<span style="color: #51afef;">save-excursion</span>
          (<span style="color: #51afef;">let</span> ((defun-end (scan-sexps (point) 1)))
            (<span style="color: #51afef;">while</span> (re-search-forward
                    (rx-to-string `(seq symbol-start ,(symbol-name sym) symbol-end))
                    defun-end t)
              (helpful--flash-region (match-beginning 0) (match-end 0)))))
        t)))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">helpful-jump-to-org</span> ()
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">when</span> (helpful-visit-reference)
      (org-babel-tangle-jump-to-org))))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org71e9979" class="outline-4">
<h4 id="org71e9979"><span class="section-number-4">2.2.5</span> Defaults</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<ol class="org-ol">
<li><a id="org5a29fa0"></a><a href="https://github.com/technomancy/better-defaults/tree/0937ac9a813632c48d114cf959768cda9676db3a">better-defaults: Fixes weird emacs quirks and poor defaults.</a><br />
<div class="outline-text-5" id="text-2-2-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">better-defaults</span>)

(<span style="color: #51afef;">setq</span> mouse-autoselect-window t
      focus-follows-mouse t)
</pre>
</div>
</div>
</li>
<li><a id="orgd0fe8a1"></a><a href="https://github.com/Malabarba/beacon">beacon: Highlight the cursor whenever the window scrolls</a><br />
<div class="outline-text-5" id="text-2-2-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">beacon</span>
  <span style="color: #c678dd;">:init</span>
  (beacon-mode 1))
</pre>
</div>
</div>
</li>

<li><a id="orge3af236"></a><a href="https://github.com/tom-tan/hlinum-mode">hlinum: highlights the current line number</a><br />
<div class="outline-text-5" id="text-2-2-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Highlight the line number of the current line.</span>
(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">hlinum</span>
  <span style="color: #c678dd;">:config</span>
  (hlinum-activate))
</pre>
</div>
</div>
</li>
<li><a id="org3fba835"></a><a href="https://github.com/joostkremers/visual-fill-column/tree/772d4b25ba19f57409cd03524be0f5bfdc2e8da1">visual-fill-column: Wraps lines at `fill-column'</a><br />
<div class="outline-text-5" id="text-2-2-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">visual-fill-column</span>
  <span style="color: #c678dd;">:commands</span> visual-fill-column-mode
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq-default</span>
   visual-fill-column-center-text t
   visual-fill-column-width
   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">take Emacs 26 line numbers into account</span>
   (+ (<span style="color: #51afef;">if</span> (boundp 'display-line-numbers) 6 0)
      fill-column)))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org0bd78bc" class="outline-3">
<h3 id="org0bd78bc"><span class="section-number-3">2.3</span> Navigation</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgf6eca7e" class="outline-4">
<h4 id="orgf6eca7e"><span class="section-number-4">2.3.1</span> config</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> scroll-error-top-bottom t)

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">smart-beginning-of-line</span> ()
  <span style="color: #83898d;">"Move point to first non-whitespace character or beginning-of-line."</span>
  (<span style="color: #51afef;">interactive</span> <span style="color: #98be65;">"^"</span>)
  (<span style="color: #51afef;">let</span> ((oldpos (point)))
    (back-to-indentation)
    (<span style="color: #51afef;">and</span> (= oldpos (point))
         (beginning-of-line))))
(global-set-key (kbd <span style="color: #98be65;">"&lt;home&gt;"</span>) 'smart-beginning-of-line)
(global-set-key (kbd <span style="color: #98be65;">"C-a"</span>) 'smart-beginning-of-line)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Consider CamelCase chunks as words when navigating.</span>
(global-subword-mode 1)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Use C-x M-p to kill the buffer in the other window, revealing</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">the next buffer in the stack.</span>
(global-set-key
 (kbd <span style="color: #98be65;">"C-x M-p"</span>)
 (<span style="color: #51afef;">lambda</span> () (<span style="color: #51afef;">interactive</span>)
   (<span style="color: #51afef;">save-excursion</span>
     (other-window 1)
     (quit-window))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgada5f1c" class="outline-4">
<h4 id="orgada5f1c"><span class="section-number-4">2.3.2</span> Buffers and Windows</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ol class="org-ol">
