config.org
***** [[https://github.com/abo-abo/ace-window/tree/138a80cbc4e9ed17d3a085a3687f5223a142a9a3][ace-window: Quickly switch windows]]
    #+BEGIN_SRC emacs-lisp :tangle
(use-package ace-window
  :commands ace-window
  :config
  (setq aw-scope 'frame))

(defun module/previous-window ()
  (interactive)
  (-let [current (selected-window)]
    (cond
     ((eq module/--last-window current)
      (ace-select-window))

     ((window-live-p module/--last-window)
      (select-window module/--last-window))

     (t
      (ace-select-window)))
    (setq module/--last-window current)))

(defun module/select-window ()
  (interactive)
  (setq module/--last-window (selected-window))
  (ace-select-window))

(setq module/--last-window (selected-window))

(global-set-key (kbd "C-x o") 'module/previous-window)
(global-set-key (kbd "C-x C-o") 'module/select-window)
(global-set-key (kbd "C-x \\") 'ace-swap-window)
    #+END_SRC
***** [[https://www.emacswiki.org/emacs/WindMove][windmove: Move point from window to window using Shift and the arrow keys]]
   #+BEGIN_SRC emacs-lisp
(use-package windmove
  :commands (windmove-up windmove-down windmove-left windmove-right))
   #+END_SRC
***** [[https://github.com/lukhas/buffer-move/tree/cb517ecf8409b5fdcda472d7190c6021f0c49751][buffer-move: Swap buffers without typing C-x b on each window]]
   #+BEGIN_SRC emacs-lisp
(use-package buffer-move)
   #+END_SRC
***** [[https://github.com/emacsorphanage/transpose-frame/tree/011f420c3496b69fc22d789f64cb8091834feba7][transpose-frame: Transpose windows arrangement in a frame]]
   #+BEGIN_SRC emacs-lisp
(use-package transpose-frame
  :commands tranpose-frame)
   #+END_SRC

**** directory
***** [[https://github.com/syohex/emacs-dired-k][dired-k: highlight dired buffer by file size, modified time, git status]]
    #+BEGIN_SRC emacs-lisp
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)

(setq ;; Always copy/delete recursively
 dired-recursive-copies  'always
 dired-recursive-deletes 'top
 ;; files
 image-dired-dir (concat user-emacs-directory "image-dired/")
 image-dired-db-file (concat user-emacs-directory "image-dired/db.el")
 image-dired-gallery-dir (concat user-emacs-directory "gallery/")
 image-dired-temp-image-file (concat user-emacs-directory "temp-image")
 image-dired-temp-rotate-image-file (concat user-emacs-directory "temp-rotate-image"))


(use-package dired-k
  :after dired
  :config
  (setq dired-k-style 'git)

  (defun +dired*dired-k-highlight (orig-fn &rest args)
    "Butt out if the requested directory is remote (i.e. through tramp)."
    (unless (file-remote-p default-directory)
      (apply orig-fn args)))
  (advice-add #'dired-k--highlight :around #'+dired*dired-k-highlight)

  (add-hook 'dired-initial-position-hook #'dired-k)
  (add-hook 'dired-after-readin-hook #'dired-k-no-revert))


;; A function for deleting the file being edited.
;; This one is a bit dangerous, even with the yes/no question, so
;; it's not bound to any key by default.
;; Run it using M-x delete-current-buffer-file.
(defun delete-current-buffer-file ()
  "Removes file connected to current buffer and kills buffer."
  (interactive)
  (let ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (if (not (and filename (file-exists-p filename)))
        (ido-kill-buffer)
      (when (yes-or-no-p "Are you sure you want to remove this file? ")
        (delete-file filename)
        (kill-buffer buffer)
        (message "File '%s' successfully removed" filename)))))

;; And a function for renaming the file being edited, bound to C-x C-r.
(defun rename-current-buffer-file ()
  "Renames current buffer and file it is visiting."
  (interactive)
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
        (if (get-buffer new-name)
            (error "A buffer named '%s' already exists!" new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message "File '%s' successfully renamed to '%s'"
                   name (file-name-nondirectory new-name)))))))
(global-set-key (kbd "C-x C-r") 'rename-current-buffer-file)

(require 'dired)

(setq wdired-use-dired-vertical-movement 'sometimes)
(define-key dired-mode-map (kbd "C-s") #'dired-isearch-filenames)
     #+END_SRC
***** [[https://github.com/mattiasb/dired-hide-dotfiles][dired-hide-dotfiles: Hide dotfiles in dired]]
    #+BEGIN_SRC emacs-lisp
(use-package dired-hide-dotfiles
  :config
  (defun my-dired-mode-hook ()
    "My `dired' mode hook."
    ;; To hide dot-files by default
    (dired-hide-dotfiles-mode)

    ;; To toggle hiding
    (define-key dired-mode-map "." #'dired-hide-dotfiles-mode))

  (add-hook 'dired-mode-hook #'my-dired-mode-hook))
   #+END_SRC
***** [[https://github.com/DamienCassou/dired-imenu/tree/610e21fe0988c85931d34894d3eee2442c79ab0a][dired-imenu: imenu binding for dired mode]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-imenu)
   #+END_SRC
