index.html
<li><a id="orgd38c4c2"></a><a href="https://github.com/abo-abo/ace-window/tree/138a80cbc4e9ed17d3a085a3687f5223a142a9a3">ace-window: Quickly switch windows</a><br />
<div class="outline-text-5" id="text-2-3-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ace-window</span>
  <span style="color: #c678dd;">:commands</span> ace-window
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> aw-scope 'frame))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module/previous-window</span> ()
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">-let</span> [current (selected-window)]
    (<span style="color: #51afef;">cond</span>
     ((eq module/--last-window current)
      (ace-select-window))

     ((window-live-p module/--last-window)
      (select-window module/--last-window))

     (t
      (ace-select-window)))
    (<span style="color: #51afef;">setq</span> module/--last-window current)))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">module/select-window</span> ()
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">setq</span> module/--last-window (selected-window))
  (ace-select-window))

(<span style="color: #51afef;">setq</span> module/--last-window (selected-window))

(global-set-key (kbd <span style="color: #98be65;">"C-x o"</span>) 'module/previous-window)
(global-set-key (kbd <span style="color: #98be65;">"C-x C-o"</span>) 'module/select-window)
(global-set-key (kbd <span style="color: #98be65;">"C-x \\"</span>) 'ace-swap-window)
</pre>
</div>
</div>
</li>
<li><a id="org6257c34"></a><a href="https://www.emacswiki.org/emacs/WindMove">windmove: Move point from window to window using Shift and the arrow keys</a><br />
<div class="outline-text-5" id="text-2-3-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">windmove</span>
  <span style="color: #c678dd;">:commands</span> (windmove-up windmove-down windmove-left windmove-right))
</pre>
</div>
</div>
</li>
<li><a id="org3f16f5e"></a><a href="https://github.com/lukhas/buffer-move/tree/cb517ecf8409b5fdcda472d7190c6021f0c49751">buffer-move: Swap buffers without typing C-x b on each window</a><br />
<div class="outline-text-5" id="text-2-3-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">buffer-move</span>)
</pre>
</div>
</div>
</li>
<li><a id="org933002f"></a><a href="https://github.com/emacsorphanage/transpose-frame/tree/011f420c3496b69fc22d789f64cb8091834feba7">transpose-frame: Transpose windows arrangement in a frame</a><br />
<div class="outline-text-5" id="text-2-3-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">transpose-frame</span>
  <span style="color: #c678dd;">:commands</span> tranpose-frame)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org354d744" class="outline-4">
<h4 id="org354d744"><span class="section-number-4">2.3.3</span> Directory</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ol class="org-ol">
<li><a id="org5ea0ae5"></a><a href="https://github.com/syohex/emacs-dired-k">dired-k: highlight dired buffer by file size, modified time, git status</a><br />
<div class="outline-text-5" id="text-2-3-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> global-auto-revert-non-file-buffers t)
(<span style="color: #51afef;">setq</span> auto-revert-verbose nil)

(<span style="color: #51afef;">setq</span> <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Always copy/delete recursively</span>
 dired-recursive-copies  'always
 dired-recursive-deletes 'top
 <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">files</span>
 image-dired-dir (concat user-emacs-directory <span style="color: #98be65;">"image-dired/"</span>)
 image-dired-db-file (concat user-emacs-directory <span style="color: #98be65;">"image-dired/db.el"</span>)
 image-dired-gallery-dir (concat user-emacs-directory <span style="color: #98be65;">"gallery/"</span>)
 image-dired-temp-image-file (concat user-emacs-directory <span style="color: #98be65;">"temp-image"</span>)
 image-dired-temp-rotate-image-file (concat user-emacs-directory <span style="color: #98be65;">"temp-rotate-image"</span>))


(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-k</span>
  <span style="color: #c678dd;">:after</span> dired
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> dired-k-style 'git)

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">+dired*dired-k-highlight</span> (orig-fn <span style="color: #ECBE7B;">&amp;rest</span> args)
    <span style="color: #83898d;">"Butt out if the requested directory is remote (i.e. through tramp)."</span>
    (<span style="color: #51afef;">unless</span> (file-remote-p default-directory)
      (apply orig-fn args)))
  (advice-add #'dired-k--highlight <span style="color: #c678dd;">:around</span> #'+dired*dired-k-highlight)

  (add-hook 'dired-initial-position-hook #'dired-k)
  (add-hook 'dired-after-readin-hook #'dired-k-no-revert))


<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">A function for deleting the file being edited.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">This one is a bit dangerous, even with the yes/no question, so</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">it's not bound to any key by default.</span>
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Run it using M-x delete-current-buffer-file.</span>
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">delete-current-buffer-file</span> ()
  <span style="color: #83898d;">"Removes file connected to current buffer and kills buffer."</span>
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">let</span> ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (<span style="color: #51afef;">if</span> (not (<span style="color: #51afef;">and</span> filename (file-exists-p filename)))
        (ido-kill-buffer)
      (<span style="color: #51afef;">when</span> (yes-or-no-p <span style="color: #98be65;">"Are you sure you want to remove this file? "</span>)
        (delete-file filename)
        (kill-buffer buffer)
        (message <span style="color: #98be65;">"File '%s' successfully removed"</span> filename)))))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">And a function for renaming the file being edited, bound to C-x C-r.</span>
(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">rename-current-buffer-file</span> ()
  <span style="color: #83898d;">"Renames current buffer and file it is visiting."</span>
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">let</span> ((name (buffer-name))
        (filename (buffer-file-name)))
    (<span style="color: #51afef;">if</span> (not (<span style="color: #51afef;">and</span> filename (file-exists-p filename)))
        (<span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Buffer '%s' is not visiting a file!"</span> name)
      (<span style="color: #51afef;">let</span> ((new-name (read-file-name <span style="color: #98be65;">"New name: "</span> filename)))
        (<span style="color: #51afef;">if</span> (get-buffer new-name)
            (<span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"A buffer named '%s' already exists!"</span> new-name)
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)
          (message <span style="color: #98be65;">"File '%s' successfully renamed to '%s'"</span>
                   name (file-name-nondirectory new-name)))))))
(global-set-key (kbd <span style="color: #98be65;">"C-x C-r"</span>) 'rename-current-buffer-file)

(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">dired</span>)

(<span style="color: #51afef;">setq</span> wdired-use-dired-vertical-movement 'sometimes)
(define-key dired-mode-map (kbd <span style="color: #98be65;">"C-s"</span>) #'dired-isearch-filenames)
</pre>
</div>
</div>
</li>
<li><a id="org6d25ebe"></a><a href="https://github.com/mattiasb/dired-hide-dotfiles">dired-hide-dotfiles: Hide dotfiles in dired</a><br />
<div class="outline-text-5" id="text-2-3-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-hide-dotfiles</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my-dired-mode-hook</span> ()
    <span style="color: #83898d;">"My `</span><span style="color: #a9a1e1;">dired</span><span style="color: #83898d;">' mode hook."</span>
    <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">To hide dot-files by default</span>
    (dired-hide-dotfiles-mode)

    <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">To toggle hiding</span>
    (define-key dired-mode-map <span style="color: #98be65;">"."</span> #'dired-hide-dotfiles-mode))

  (add-hook 'dired-mode-hook #'my-dired-mode-hook))
</pre>
</div>
</div>
</li>
<li><a id="org0c6535e"></a><a href="https://github.com/DamienCassou/dired-imenu/tree/610e21fe0988c85931d34894d3eee2442c79ab0a">dired-imenu: imenu binding for dired mode</a><br />
<div class="outline-text-5" id="text-2-3-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-imenu</span>)
</pre>
</div>
</div>
</li>
