config.org
***** [[https://github.com/stsquad/dired-rsync/tree/d7eb558c4efa73d9e1f50709dbd2374041c0f1a9][dired-rsync: Allow rsync from dired buffers]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-rsync
  :commands dired-rsync
  :config
  (bind-key "C-c C-r" 'dired-rsync dired-mode-map))
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-hack-utils: Utilities and helpers for dired-hacks collection]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-hacks-utils)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-filter: Ibuffer-like filtering for dired]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-filter)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-avfs: AVFS support for dired]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-avfs
  :commands dired-avfs-open)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-open: Open files from dired using using custom actions]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-open)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-narrow: Provides live filtering of files in dired buffers]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-narrow)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-subtree: Insert subdirectories in a tree-like fashion]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-subtree)
   #+END_SRC
***** [[https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30][dired-collapse: Collapse unique nested paths in dired listing]]
   #+BEGIN_SRC emacs-lisp
(use-package dired-collapse)
   #+END_SRC
*** Editor
