index.html
<li><a id="org034248a"></a><a href="https://github.com/stsquad/dired-rsync/tree/d7eb558c4efa73d9e1f50709dbd2374041c0f1a9">dired-rsync: Allow rsync from dired buffers</a><br />
<div class="outline-text-5" id="text-2-3-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-rsync</span>
  <span style="color: #c678dd;">:commands</span> dired-rsync
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">bind-key</span> <span style="color: #98be65;">"C-c C-r"</span> 'dired-rsync dired-mode-map))
</pre>
</div>
</div>
</li>
<li><a id="orgd929cf2"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-hack-utils: Utilities and helpers for dired-hacks collection</a><br />
<div class="outline-text-5" id="text-2-3-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-hacks-utils</span>)
</pre>
</div>
</div>
</li>
<li><a id="orgc2082be"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-filter: Ibuffer-like filtering for dired</a><br />
<div class="outline-text-5" id="text-2-3-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-filter</span>)
</pre>
</div>
</div>
</li>
<li><a id="org73f599b"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-avfs: AVFS support for dired</a><br />
<div class="outline-text-5" id="text-2-3-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-avfs</span>
  <span style="color: #c678dd;">:commands</span> dired-avfs-open)
</pre>
</div>
</div>
</li>
<li><a id="org66d075f"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-open: Open files from dired using using custom actions</a><br />
<div class="outline-text-5" id="text-2-3-3-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-open</span>)
</pre>
</div>
</div>
</li>
<li><a id="org22a17e1"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-narrow: Provides live filtering of files in dired buffers</a><br />
<div class="outline-text-5" id="text-2-3-3-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-narrow</span>)
</pre>
</div>
</div>
</li>
<li><a id="org6895ea0"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-subtree: Insert subdirectories in a tree-like fashion</a><br />
<div class="outline-text-5" id="text-2-3-3-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-subtree</span>)
</pre>
</div>
</div>
</li>
<li><a id="org263b35f"></a><a href="https://github.com/Fuco1/dired-hacks/tree/20631398b1927e2da36ac2dd818001db544e9f30">dired-collapse: Collapse unique nested paths in dired listing</a><br />
<div class="outline-text-5" id="text-2-3-3-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">dired-collapse</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
