config.org
**** config
  #+BEGIN_SRC emacs-lisp :tangle
(setq bookmark-save-flag 1) ;; save after every change

(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)
      select-enable-clipboard t
      select-enable-primary t)

(setq-default
 fill-column 100                  ; set line-wrapping column to 100
 word-wrap t                     ; enable word wrap so lines are wrapped at nearest space
 truncate-lines t
 truncate-partial-width-windows 50)

(setq-default
 indent-tabs-mode nil         ; don't insert tabs by default
 require-final-newline t      ; ensure newline exists at end of file
 tab-always-indent t          ; always indent line when pressing TAB (don't add tab character)
 tab-width 2                  ; default tab width of 2 characters
 tabify-regexp "^\t* [ \t]+") ; only tabify initial whitespace when converting to tabifying

(setq-default
 vc-follow-symlinks t                             ; automatically follow symlinks
 save-interprogram-paste-before-kill t)           ; save clipboard contents into kill-ring before replacing them
(global-auto-revert-mode t)                       ; revert changed buffers
(show-paren-mode)                                 ; highlight matching parenthesis
(push '("/LICENSE$" . text-mode) auto-mode-alist) ; license files should be handled in text mode

;; whitespace-mode
(setq-default
 whitespace-line-column fill-column
 whitespace-style
 '(face indentation tabs tab-mark spaces space-mark newline newline-mark trailing lines-tail)
 whitespace-display-mappings
 '((tab-mark ?\t [?› ?\t])
   (newline-mark ?\n [?¬ ?\n])
   (space-mark ?\  [?·] [?.])))

(setq-default
 scroll-conservatively 1001             ; always scroll to the point no matter how far away (don't recenter)
 scroll-margin 3                        ; don't automatically scroll to retain a margin
 scroll-preserve-screen-position t)     ; preserve point location on screen when scrolling

(setq require-final-newline t)

(setq echo-keystrokes 0.001)

(setq-default indent-tabs-mode nil)   ;; don't use tabs to indent
(setq-default tab-width 8)            ;; but maintain correct appearance


(require 'super-save)
;; add integration with ace-window
(add-to-list 'super-save-triggers 'ace-window)
(super-save-mode +1)


(setq tab-always-indent 'complete)

(setq hippie-expand-try-functions-list '(try-expand-dabbrev
                                         try-expand-dabbrev-all-buffers
                                         try-expand-dabbrev-from-kill
                                         try-complete-file-name-partially
                                         try-complete-file-name
                                         try-expand-all-abbrevs
                                         try-expand-list
                                         try-expand-line
                                         try-complete-lisp-symbol-partially
                                         try-complete-lisp-symbol))

(global-auto-revert-mode t)

(windmove-default-keybindings)

(require 'tramp)
;; keep in mind known issues with zsh - see emacs wiki
(setq tramp-default-method "ssh")

(setq ispell-program-name "aspell" ; use aspell instead of ispell
      ispell-extra-args '("--sug-mode=ultra"))

;; enable narrowing commands
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-defun 'disabled nil)

;; enabled change region case commands
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

;; enable erase-buffer command
(put 'erase-buffer 'disabled nil)


(defun indent-buffer ()
  (interactive)
  (indent-region (point-min) (point-max)))
(global-set-key (kbd "C-c <tab>") 'indent-buffer)

  #+END_SRC

**** Jump / Goto
***** [[https://github.com/abo-abo/avy/tree/f91ae613a86187c8ca75e86f22e3f5ac9958399c][avy: Jump to arbitrary positions in visible text and select text quickly]]
   #+BEGIN_SRC emacs-lisp
(use-package avy
  :commands avy-goto-word
  :config
  (setq avy-background t)
  (setq avy-style 'at-full))
   #+END_SRC

***** goto-chg
   #+BEGIN_SRC emacs-lisp
(use-package goto-chg
  :bind (("C-c \\" . goto-last-change)
         ("C-c |" . goto-last-change-reverse)))
   #+END_SRC

**** Selection / Insertion
***** [[https://github.com/magnars/expand-region.el/tree/1c31447730443d98f90f65dfcb752f347d46ad1b][expand-region: Increase selected region by semantic units]]
   #+BEGIN_SRC emacs-lisp
(use-package expand-region
  :commands er/expand-region)
   #+END_SRC
***** [[https://github.com/Fuco1/smartparens/tree/046440700f292c90c4a992f959c8d6725aa9a3bc][smartparens: Automatic insertion, wrapping of parens]]
   #+BEGIN_SRC emacs-lisp
(use-package smartparens
  :commands smartparens-mode)
   #+END_SRC
***** [[https://github.com/Fanael/edit-indirect/tree/de645d8144e8a08f039a9c88185121ec81d957ef][edit-indirect: Edit a region in a separate buffer]]
   #+BEGIN_SRC emacs-lisp
(use-package edit-indirect
  :bind (("C-c '" . edit-indirect-dwim)
         :map edit-indirect-mode-map
         ("C-x n" . edit-indirect-commit)))
   #+END_SRC

