index.html
<div id="outline-container-org2685feb" class="outline-3">
<h3 id="org2685feb"><span class="section-number-3">2.4</span> Editor</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org7888e03" class="outline-4">
<h4 id="org7888e03"><span class="section-number-4">2.4.1</span> config</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> bookmark-save-flag 1) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">save after every change</span>

(<span style="color: #51afef;">setq</span> x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)
      select-enable-clipboard t
      select-enable-primary t)

(<span style="color: #51afef;">setq-default</span>
 fill-column 100                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">set line-wrapping column to 100</span>
 word-wrap t                     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">enable word wrap so lines are wrapped at nearest space</span>
 truncate-lines t
 truncate-partial-width-windows 50)

(<span style="color: #51afef;">setq-default</span>
 indent-tabs-mode nil         <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't insert tabs by default</span>
 require-final-newline t      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">ensure newline exists at end of file</span>
 tab-always-indent t          <span style="color: #5B6268;">; </span><span style="color: #5B6268;">always indent line when pressing TAB (don't add tab character)</span>
 tab-width 2                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">default tab width of 2 characters</span>
 tabify-regexp <span style="color: #98be65;">"^\t* [ \t]+"</span>) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">only tabify initial whitespace when converting to tabifying</span>

(<span style="color: #51afef;">setq-default</span>
 vc-follow-symlinks t                             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">automatically follow symlinks</span>
 save-interprogram-paste-before-kill t)           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">save clipboard contents into kill-ring before replacing them</span>
(global-auto-revert-mode t)                       <span style="color: #5B6268;">; </span><span style="color: #5B6268;">revert changed buffers</span>
(show-paren-mode)                                 <span style="color: #5B6268;">; </span><span style="color: #5B6268;">highlight matching parenthesis</span>
(<span style="color: #51afef;">push</span> '(<span style="color: #98be65;">"/LICENSE$"</span> . text-mode) auto-mode-alist) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">license files should be handled in text mode</span>

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">whitespace-mode</span>
(<span style="color: #51afef;">setq-default</span>
 whitespace-line-column fill-column
 whitespace-style
 '(face indentation tabs tab-mark spaces space-mark newline newline-mark trailing lines-tail)
 whitespace-display-mappings
 '((tab-mark ?\t [?&#8250; ?\t])
   (newline-mark ?\n [?&#172; ?\n])
   (space-mark ?\  [?&#183;] [?.])))

(<span style="color: #51afef;">setq-default</span>
 scroll-conservatively 1001             <span style="color: #5B6268;">; </span><span style="color: #5B6268;">always scroll to the point no matter how far away (don't recenter)</span>
 scroll-margin 3                        <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't automatically scroll to retain a margin</span>
 scroll-preserve-screen-position t)     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">preserve point location on screen when scrolling</span>

(<span style="color: #51afef;">setq</span> require-final-newline t)

(<span style="color: #51afef;">setq</span> echo-keystrokes 0.001)

(<span style="color: #51afef;">setq-default</span> indent-tabs-mode nil)   <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">don't use tabs to indent</span>
(<span style="color: #51afef;">setq-default</span> tab-width 8)            <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">but maintain correct appearance</span>


(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">super-save</span>)
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">add integration with ace-window</span>
(add-to-list 'super-save-triggers 'ace-window)
(super-save-mode +1)


(<span style="color: #51afef;">setq</span> tab-always-indent 'complete)

(<span style="color: #51afef;">setq</span> hippie-expand-try-functions-list '(try-expand-dabbrev
                                         try-expand-dabbrev-all-buffers
                                         try-expand-dabbrev-from-kill
                                         try-complete-file-name-partially
                                         try-complete-file-name
                                         try-expand-all-abbrevs
                                         try-expand-list
                                         try-expand-line
                                         try-complete-lisp-symbol-partially
                                         try-complete-lisp-symbol))

(global-auto-revert-mode t)

(windmove-default-keybindings)

(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">tramp</span>)
<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">keep in mind known issues with zsh - see emacs wiki</span>
(<span style="color: #51afef;">setq</span> tramp-default-method <span style="color: #98be65;">"ssh"</span>)

(<span style="color: #51afef;">setq</span> ispell-program-name <span style="color: #98be65;">"aspell"</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">use aspell instead of ispell</span>
      ispell-extra-args '(<span style="color: #98be65;">"--sug-mode=ultra"</span>))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">enable narrowing commands</span>
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-defun 'disabled nil)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">enabled change region case commands</span>
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">enable erase-buffer command</span>
(put 'erase-buffer 'disabled nil)


(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">indent-buffer</span> ()
  (<span style="color: #51afef;">interactive</span>)
  (indent-region (point-min) (point-max)))
(global-set-key (kbd <span style="color: #98be65;">"C-c &lt;tab&gt;"</span>) 'indent-buffer)

</pre>
</div>
</div>
</div>

<div id="outline-container-org953d022" class="outline-4">
<h4 id="org953d022"><span class="section-number-4">2.4.2</span> Jump / Goto</h4>
<div class="outline-text-4" id="text-2-4-2">
</div>
<ol class="org-ol">
<li><a id="org808e4f5"></a><a href="https://github.com/abo-abo/avy/tree/f91ae613a86187c8ca75e86f22e3f5ac9958399c">avy: Jump to arbitrary positions in visible text and select text quickly</a><br />
<div class="outline-text-5" id="text-2-4-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">avy</span>
  <span style="color: #c678dd;">:commands</span> avy-goto-word
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> avy-background t)
  (<span style="color: #51afef;">setq</span> avy-style 'at-full))
</pre>
</div>
</div>
</li>

<li><a id="orgb0b9d81"></a>goto-chg<br />
<div class="outline-text-5" id="text-2-4-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">goto-chg</span>
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-c \\"</span> . goto-last-change)
         (<span style="color: #98be65;">"C-c |"</span> . goto-last-change-reverse)))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org570ee44" class="outline-4">
<h4 id="org570ee44"><span class="section-number-4">2.4.3</span> Selection / Insertion</h4>
<div class="outline-text-4" id="text-2-4-3">
</div>
<ol class="org-ol">
<li><a id="orge35a369"></a><a href="https://github.com/magnars/expand-region.el/tree/1c31447730443d98f90f65dfcb752f347d46ad1b">expand-region: Increase selected region by semantic units</a><br />
<div class="outline-text-5" id="text-2-4-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">expand-region</span>
  <span style="color: #c678dd;">:commands</span> er/expand-region)
</pre>
</div>
</div>
</li>
<li><a id="orga1ab0ca"></a><a href="https://github.com/Fuco1/smartparens/tree/046440700f292c90c4a992f959c8d6725aa9a3bc">smartparens: Automatic insertion, wrapping of parens</a><br />
<div class="outline-text-5" id="text-2-4-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">smartparens</span>
  <span style="color: #c678dd;">:commands</span> smartparens-mode)
</pre>
</div>
</div>
</li>
<li><a id="org4b1a726"></a><a href="https://github.com/Fanael/edit-indirect/tree/de645d8144e8a08f039a9c88185121ec81d957ef">edit-indirect: Edit a region in a separate buffer</a><br />
<div class="outline-text-5" id="text-2-4-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">edit-indirect</span>
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-c '"</span> . edit-indirect-dwim)
         <span style="color: #c678dd;">:map</span> edit-indirect-mode-map
         (<span style="color: #98be65;">"C-x n"</span> . edit-indirect-commit)))
</pre>
</div>
</div>
</li>
