config.org
***** [[https://github.com/browse-kill-ring/browse-kill-ring/tree/8debc43e41d7e51532698331c6f283905890b904][browse-kill-ring: Interactively insert items from kill-ring]]
   #+BEGIN_SRC emacs-lisp
(use-package browse-kill-ring
  :commands browse-kill-ring)
(require 'browse-kill-ring)
(browse-kill-ring-default-keybindings)
(global-set-key (kbd "s-y") 'browse-kill-ring)
   #+END_SRC

**** Syntax checking
***** [[https://github.com/flycheck/flycheck/tree/bd8a93240aee78e90c83a54ab3799ff4d02f9f15][flycheck: On-the-fly syntax checking]]
   #+BEGIN_SRC emacs-lisp
(use-package flycheck
  :commands flycheck-mode
  :config
  (global-set-key (kbd "M-n") 'next-error)
  (global-set-key (kbd "M-p") 'previous-error)
  ;; Start it automatically for all modes except ELisp mode,
  (add-hook 'find-file-hook
            (lambda ()
              (when (not (equal 'emacs-lisp-mode major-mode))
                (flycheck-mode)))))

   #+END_SRC
***** [[https://github.com/flycheck/flycheck-color-mode-line/tree/cc474804d4e8088a627485faaf4217a5781aec7d][flycheck-color-mode-line: Change mode line color with Flycheck status]]
   #+BEGIN_SRC emacs-lisp
(use-package flycheck-color-mode-line
  :config
  (with-eval-after-load "flycheck"
    (setq flycheck-highlighting-mode 'symbols)
    (add-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode)))
   #+END_SRC

**** Search / Replace
***** [[https://github.com/mhayashi1120/Emacs-wgrep/tree/379afd89ebd76f63842c8589127d66096a8bb595][wgrep: Writable grep buffer and apply the changes to files]]
   #+BEGIN_SRC emacs-lisp
(use-package wgrep
  :commands
  wgrep-change-to-wgrep-mode
  ivy-wgrep-change-to-wgrep-mode)
   #+END_SRC
***** [[https://github.com/Wilfred/deadgrep/tree/caeb37b8d6ab83f0eba353d6bbb29678190d4419][deadgrep: Fast, friendly searching with ripgrep]]
   #+BEGIN_SRC emacs-lisp
(use-package deadgrep
  :commands deadgrep
  :bind* (("M-s" . deadgrep)))
   #+END_SRC

***** [[https://github.com/syohex/emacs-anzu/tree/592f8ee6d0b1bc543943b36a30063c2d1aac4b22][anzu: Show number of matches in mode-line while searching]]
   #+BEGIN_SRC emacs-lisp
(use-package anzu
  :commands anzy-query-replace
  :config
  (global-anzu-mode 1)
  ;; Anzu provides a version of `query-replace' and friends which give visual
  ;; feedback when composing regexps. Let's replace the regular versions.
  :bind(("C-%" . anzu-query-replace-at-cursor)
        ("M-%" . anzu-query-replace)
        ("C-M-%" . anzu-query-replace-regexp))
  )
   #+END_SRC

***** [[https://github.com/abo-abo/swiper/tree/b528f0f3aaa86a40fdec06bdb06c603ce1418bcb][swiper: Display current regex search candidates]]
   #+BEGIN_SRC emacs-lisp
(use-package swiper
  :commands swiper
  :bind
  (("C-s" . swiper)
   ("C-r" . counsel-grep-or-swiper)
   :map swiper-map
   ("M-q" . swiper-query-replace)
   ("C-l". swiper-recenter-top-bottom))
  :custom
  (counsel-grep-swiper-limit 20000)
  (counsel-rg-base-command
   "rg -i -M 160 --no-heading --line-number --color never %s .")
  (counsel-grep-base-command
   "rg -i -M 160 --no-heading --line-number --color never '%s' %s"))
   #+END_SRC
****** Counsel
******* [[https://github.com/abo-abo/swiper/][counsel: Various completion functions using Ivy]]
     #+BEGIN_SRC emacs-lisp
(use-package counsel
  :hook
  (after-init . ivy-mode)
  :bind
  (
   ("M-x" . counsel-M-x)
   ("C-x x" . counsel-M-x)
   ("<execute>" . counsel-M-x)
   ("C-x i" . counsel-imenu)
   ("C-h f" . counsel-describe-function)
   ("C-h v" . counsel-describe-variable)
   ("C-x b" . ivy-switch-buffer)
   ("C-x B" . counsel-switch-buffer-other-window)
   ("C-x k" . kill-buffer)
   ("C-x C-f" . counsel-find-file)
   ("C-x l" . counsel-locate)
   :map ivy-minibuffer-map
   ("C-o" . ivy-occur)
   ("<return>" . ivy-alt-done)
   ("M-<return>" . ivy-immediate-done)
   :map read-expression-map
   ("C-r" . counsel-minibuffer-history))
  :custom
  (counsel-find-file-at-point t)
  (ivy-display-style 'fancy)
  (ivy-use-selectable-prompt t)
  (ivy-re-builders-alist
   '((ivy-switch-buffer . ivy--regex-plus)
     (swiper . ivy--regex-plus)
     (t . ivy--regex-fuzzy)))
  :config
  (defun my/counsel-switch-buffer-other-window ()
    (interactive)
    (ace-window nil)
    (counsel-switch-buffer))
  (ivy-set-actions
   t
   '(("I" insert "insert")))
  (ivy-set-occur 'ivy-switch-buffer 'ivy-switch-buffer-occur)

(ivy-add-actions 'counsel-find-file
                   `(("l" find-file-literally "open literally")))


  ;; Make ivy faster/more responsive
  ;; Update filter every 10ms and wait 20ms to refresh dynamic collection

(setq counsel-async-filter-update-time 10000)
  (setq ivy-dynamic-exhibit-delay-ms 20)

(setq counsel-git-cmd "rg -S --files")



)
     #+END_SRC
