index.html

<li><a id="org3a3c0f6"></a><a href="https://github.com/browse-kill-ring/browse-kill-ring/tree/8debc43e41d7e51532698331c6f283905890b904">browse-kill-ring: Interactively insert items from kill-ring</a><br />
<div class="outline-text-5" id="text-2-4-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">browse-kill-ring</span>
  <span style="color: #c678dd;">:commands</span> browse-kill-ring)
(<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">browse-kill-ring</span>)
(browse-kill-ring-default-keybindings)
(global-set-key (kbd <span style="color: #98be65;">"s-y"</span>) 'browse-kill-ring)
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org3026baa" class="outline-4">
<h4 id="org3026baa"><span class="section-number-4">2.4.4</span> Syntax checking</h4>
<div class="outline-text-4" id="text-2-4-4">
</div>
<ol class="org-ol">
<li><a id="org70b0a6a"></a><a href="https://github.com/flycheck/flycheck/tree/bd8a93240aee78e90c83a54ab3799ff4d02f9f15">flycheck: On-the-fly syntax checking</a><br />
<div class="outline-text-5" id="text-2-4-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">flycheck</span>
  <span style="color: #c678dd;">:commands</span> flycheck-mode
  <span style="color: #c678dd;">:config</span>
  (global-set-key (kbd <span style="color: #98be65;">"M-n"</span>) 'next-error)
  (global-set-key (kbd <span style="color: #98be65;">"M-p"</span>) 'previous-error)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Start it automatically for all modes except ELisp mode,</span>
  (add-hook 'find-file-hook
            (<span style="color: #51afef;">lambda</span> ()
              (<span style="color: #51afef;">when</span> (not (equal 'emacs-lisp-mode major-mode))
                (flycheck-mode)))))

</pre>
</div>
</div>
</li>
<li><a id="org08d842d"></a><a href="https://github.com/flycheck/flycheck-color-mode-line/tree/cc474804d4e8088a627485faaf4217a5781aec7d">flycheck-color-mode-line: Change mode line color with Flycheck status</a><br />
<div class="outline-text-5" id="text-2-4-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">flycheck-color-mode-line</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">with-eval-after-load</span> <span style="color: #98be65;">"flycheck"</span>
    (<span style="color: #51afef;">setq</span> flycheck-highlighting-mode 'symbols)
    (add-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode)))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2916a71" class="outline-4">
<h4 id="org2916a71"><span class="section-number-4">2.4.5</span> Search / Replace</h4>
<div class="outline-text-4" id="text-2-4-5">
</div>
<ol class="org-ol">
<li><a id="orgea6a5fa"></a><a href="https://github.com/mhayashi1120/Emacs-wgrep/tree/379afd89ebd76f63842c8589127d66096a8bb595">wgrep: Writable grep buffer and apply the changes to files</a><br />
<div class="outline-text-5" id="text-2-4-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">wgrep</span>
  <span style="color: #c678dd;">:commands</span>
  wgrep-change-to-wgrep-mode
  ivy-wgrep-change-to-wgrep-mode)
</pre>
</div>
</div>
</li>
<li><a id="org0a74419"></a><a href="https://github.com/Wilfred/deadgrep/tree/caeb37b8d6ab83f0eba353d6bbb29678190d4419">deadgrep: Fast, friendly searching with ripgrep</a><br />
<div class="outline-text-5" id="text-2-4-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">deadgrep</span>
  <span style="color: #c678dd;">:commands</span> deadgrep
  <span style="color: #c678dd;">:bind*</span> ((<span style="color: #98be65;">"M-s"</span> . deadgrep)))
</pre>
</div>
</div>
</li>

<li><a id="org4ea4ddc"></a><a href="https://github.com/syohex/emacs-anzu/tree/592f8ee6d0b1bc543943b36a30063c2d1aac4b22">anzu: Show number of matches in mode-line while searching</a><br />
<div class="outline-text-5" id="text-2-4-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">anzu</span>
  <span style="color: #c678dd;">:commands</span> anzy-query-replace
  <span style="color: #c678dd;">:config</span>
  (global-anzu-mode 1)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Anzu provides a version of `</span><span style="color: #a9a1e1;">query-replace</span><span style="color: #5B6268;">' and friends which give visual</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">feedback when composing regexps. Let's replace the regular versions.</span>
  <span style="color: #c678dd;">:bind</span>((<span style="color: #98be65;">"C-%"</span> . anzu-query-replace-at-cursor)
        (<span style="color: #98be65;">"M-%"</span> . anzu-query-replace)
        (<span style="color: #98be65;">"C-M-%"</span> . anzu-query-replace-regexp))
  )
</pre>
</div>
</div>
</li>

<li><a id="orge15e4c6"></a><a href="https://github.com/abo-abo/swiper/tree/b528f0f3aaa86a40fdec06bdb06c603ce1418bcb">swiper: Display current regex search candidates</a><br />
<div class="outline-text-5" id="text-2-4-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">swiper</span>
  <span style="color: #c678dd;">:commands</span> swiper
  <span style="color: #c678dd;">:bind</span>
  ((<span style="color: #98be65;">"C-s"</span> . swiper)
   (<span style="color: #98be65;">"C-r"</span> . counsel-grep-or-swiper)
   <span style="color: #c678dd;">:map</span> swiper-map
   (<span style="color: #98be65;">"M-q"</span> . swiper-query-replace)
   (<span style="color: #98be65;">"C-l"</span>. swiper-recenter-top-bottom))
  <span style="color: #c678dd;">:custom</span>
  (counsel-grep-swiper-limit 20000)
  (counsel-rg-base-command
   <span style="color: #98be65;">"rg -i -M 160 --no-heading --line-number --color never %s ."</span>)
  (counsel-grep-base-command
   <span style="color: #98be65;">"rg -i -M 160 --no-heading --line-number --color never '%s' %s"</span>))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org09f757b"></a>Counsel<br />
<ol class="org-ol">
<li><a id="org16dfc0b"></a><a href="https://github.com/abo-abo/swiper/">counsel: Various completion functions using Ivy</a><br />
<div class="outline-text-7" id="text-2-4-5-4-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">counsel</span>
  <span style="color: #c678dd;">:hook</span>
  (after-init . ivy-mode)
  <span style="color: #c678dd;">:bind</span>
  (
   (<span style="color: #98be65;">"M-x"</span> . counsel-M-x)
   (<span style="color: #98be65;">"C-x x"</span> . counsel-M-x)
   (<span style="color: #98be65;">"&lt;execute&gt;"</span> . counsel-M-x)
   (<span style="color: #98be65;">"C-x i"</span> . counsel-imenu)
   (<span style="color: #98be65;">"C-h f"</span> . counsel-describe-function)
   (<span style="color: #98be65;">"C-h v"</span> . counsel-describe-variable)
   (<span style="color: #98be65;">"C-x b"</span> . ivy-switch-buffer)
   (<span style="color: #98be65;">"C-x B"</span> . counsel-switch-buffer-other-window)
   (<span style="color: #98be65;">"C-x k"</span> . kill-buffer)
   (<span style="color: #98be65;">"C-x C-f"</span> . counsel-find-file)
   (<span style="color: #98be65;">"C-x l"</span> . counsel-locate)
   <span style="color: #c678dd;">:map</span> ivy-minibuffer-map
   (<span style="color: #98be65;">"C-o"</span> . ivy-occur)
   (<span style="color: #98be65;">"&lt;return&gt;"</span> . ivy-alt-done)
   (<span style="color: #98be65;">"M-&lt;return&gt;"</span> . ivy-immediate-done)
   <span style="color: #c678dd;">:map</span> read-expression-map
   (<span style="color: #98be65;">"C-r"</span> . counsel-minibuffer-history))
  <span style="color: #c678dd;">:custom</span>
  (counsel-find-file-at-point t)
  (ivy-use-virtual-buffers nil)
  (ivy-display-style 'fancy)
  (ivy-use-selectable-prompt t)
  (ivy-re-builders-alist
   '((ivy-switch-buffer . ivy--regex-plus)
     (swiper . ivy--regex-plus)
     (t . ivy--regex-fuzzy)))
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/counsel-switch-buffer-other-window</span> ()
    (<span style="color: #51afef;">interactive</span>)
    (ace-window nil)
    (counsel-switch-buffer))
  (ivy-set-actions
   t
   '((<span style="color: #98be65;">"I"</span> insert <span style="color: #98be65;">"insert"</span>)))
  (ivy-set-occur 'ivy-switch-buffer 'ivy-switch-buffer-occur)

(ivy-add-actions 'counsel-find-file
                   `((<span style="color: #98be65;">"l"</span> find-file-literally <span style="color: #98be65;">"open literally"</span>)))


  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Make ivy faster/more responsive</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Update filter every 10ms and wait 20ms to refresh dynamic collection</span>

(<span style="color: #51afef;">setq</span> counsel-async-filter-update-time 10000)
  (<span style="color: #51afef;">setq</span> ivy-dynamic-exhibit-delay-ms 20)

(<span style="color: #51afef;">setq</span> counsel-git-cmd <span style="color: #98be65;">"rg -S --files"</span>)



)
</pre>
</div>
</div>
</li>
