index.html
<li><a id="org978acc8"></a><a href="https://github.com/ericdanan/counsel-projectile/tree/fb19569c9799e3edac7504d21a5ecf49231e9500">counsel-projectile: Ivy integration for Projectile</a><br />
<div class="outline-text-7" id="text-2-4-5-4-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">counsel-projectile</span>
  <span style="color: #c678dd;">:after</span> ivy projectile
  <span style="color: #c678dd;">:bind</span> ((<span style="color: #98be65;">"C-c s"</span> . counsel-projectile-rg))
  <span style="color: #c678dd;">:config</span>
  (define-key projectile-mode-map [remap projectile-ag] #'counsel-projectile-rg)

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">parent-directory</span> (dir <span style="color: #ECBE7B;">&amp;optional</span> l)
    <span style="color: #83898d;">"Go up L many directories from DIR. Go 1 parent up when L is nil."</span>
    (<span style="color: #51afef;">let</span> ((l (<span style="color: #51afef;">or</span> l 1)))
      (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">or</span> (equal <span style="color: #98be65;">"/"</span> dir) (&lt;= l 0))
          dir
        (parent-directory (file-name-directory (directory-file-name dir)) (1- l)))))

  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">https://github.com/purcell/emacs.d/blob/4e487d4ef2ab39875d96fd413fca3b075faf9612/lisp/init-ivy.el#L49</span>
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/counsel-search-project</span> (initial-input <span style="color: #ECBE7B;">&amp;optional</span> use-current-dir)
    <span style="color: #83898d;">"Search using `</span><span style="color: #a9a1e1;">counsel-rg</span><span style="color: #83898d;">' from the project root for INITIAL-INPUT.</span>
<span style="color: #83898d;">If there is no project root, or if the prefix argument USE-CURRENT-DIR is set,</span>
<span style="color: #83898d;">then search from the current directory instead.</span>
<span style="color: #83898d;">With multiple prefix arguments, or a numeric prefix argument</span>
<span style="color: #83898d;">go up multiple parent directories."</span>
    (<span style="color: #51afef;">interactive</span> (list (thing-at-point 'symbol)
                       current-prefix-arg))
    (<span style="color: #51afef;">let</span> ((current-prefix-arg)
          (ignored (mapconcat (<span style="color: #51afef;">lambda</span> (i)
                                (concat <span style="color: #98be65;">"--glob "</span>
                                        (shell-quote-argument (concat <span style="color: #98be65;">"!"</span> i))
                                        <span style="color: #98be65;">" "</span>))
                              (append (projectile-ignored-files-rel)
                                      (projectile-ignored-directories-rel))
                              <span style="color: #98be65;">""</span>))
          (dir (<span style="color: #51afef;">cond</span>
                ((equal use-current-dir nil) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">no prefix: use project root</span>
                 (<span style="color: #51afef;">condition-case</span> _err
                     (projectile-project-root)
                   (<span style="color: #ECBE7B;">error</span> default-directory)))
                ((equal use-current-dir '(4)) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">C-u: use current dir</span>
                 (parent-directory default-directory 0))
                ((equal use-current-dir '(16)) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">C-u C-u: use parent dir</span>
                 (parent-directory default-directory 1))
                ((equal use-current-dir '(64)) <span style="color: #5B6268;">; </span><span style="color: #5B6268;">C-u C-u C-u: go 2 up</span>
                 (parent-directory default-directory 2))
                (t  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">Numeric prefix: Go specified prefix up</span>
                 (parent-directory default-directory use-current-dir)))))
      (counsel-rg initial-input dir ignored (projectile-prepend-project-name <span style="color: #98be65;">"rg"</span>))))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/counsel-search-project-empty</span> (<span style="color: #ECBE7B;">&amp;optional</span> use-current-dir)
    <span style="color: #83898d;">"Like my/counsel-search-project but with no initial input."</span>
    (<span style="color: #51afef;">interactive</span> <span style="color: #98be65;">"P"</span>)
    (my/counsel-search-project <span style="color: #98be65;">""</span> use-current-dir))

  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">counsel-projectile-find-file-occur</span> ()
    (cd (projectile-project-root))
    (counsel-cmd-to-dired
     (format
      <span style="color: #98be65;">"find . | grep -i -E '%s' | xargs -d '\n' ls"</span>
      (counsel-unquote-regex-parens ivy--old-re))))
  (ivy-set-occur 'counsel-projectile-find-file 'counsel-projectile-find-file-occur)
  (ivy-set-occur 'counsel-projectile 'counsel-projectile-find-file-occur)

  (counsel-projectile-mode))
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org0c45641" class="outline-4">
<h4 id="org0c45641"><span class="section-number-4">2.4.6</span> Completion</h4>
<div class="outline-text-4" id="text-2-4-6">
</div>
<ol class="org-ol">
<li><a id="orga59132d"></a><a href="https://github.com/abo-abo/swiper">ivy: Incremental Vertical completion</a><br />
<div class="outline-text-5" id="text-2-4-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> ivy-height 15                                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">slightly longer ivy completions list</span>
        ivy-wrap t                                     <span style="color: #5B6268;">; </span><span style="color: #5B6268;">wrap around at end of completions list</span>
        ivy-fixed-height-minibuffer t                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">use consistent height for ivy</span>
        projectile-completion-system 'ivy              <span style="color: #5B6268;">; </span><span style="color: #5B6268;">use ivy for projectile</span>
        smex-completion-method 'ivy                    <span style="color: #5B6268;">; </span><span style="color: #5B6268;">use ivy for smex</span>
        ivy-initial-inputs-alist nil                   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't use ^ as initial input</span>
        ivy-format-function #'ivy-format-function-line <span style="color: #5B6268;">; </span><span style="color: #5B6268;">highlight til EOL</span>
        ivy-use-virtual-buffers t                      <span style="color: #5B6268;">; </span><span style="color: #5B6268;">dont' show recent files in switch-buffer</span>
        ivy-virtual-abbreviate 'full                   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">show full path if showing virtual buffer</span>
        ivy-magic-slash-non-match-action nil           <span style="color: #5B6268;">; </span><span style="color: #5B6268;">disable magic slash on non-match</span>
        ivy-on-del-error-function nil                  <span style="color: #5B6268;">; </span><span style="color: #5B6268;">don't quit minibuffer on delete-error</span>
        ivy-height 18
        ivy-count-format <span style="color: #98be65;">"%d/%d "</span>
        ivy-use-selectable-prompt t)                   <span style="color: #5B6268;">; </span><span style="color: #5B6268;">allow input prompt value to be selectable</span>


  (<span style="color: #51afef;">after!</span> magit     (<span style="color: #51afef;">setq</span> magit-completing-read-function #'ivy-completing-read)))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org33e8c44"></a><a href="https://github.com/PythonNut/historian.el/tree/64f4ef8cd4e417dfa090138a2d4ea1e72fd4456a">ivy-historian: Persistently store selected minibuffer candidates</a><br />
<div class="outline-text-6" id="text-2-4-6-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy-historian</span>
<span style="color: #c678dd;">:commands</span> (ivy-historian))
</pre>
</div>
</div>
</li>
