config.org
****** [[https://github.com/Yevgnen/ivy-rich/tree/f6bfa293c6df0b43cc411876b665816ec3f03d08][ivy-rich: More friendly display transformer for ivy]]
    #+BEGIN_SRC emacs-lisp
(use-package ivy-rich
  :config
(setq ivy-rich-display-transformers-list
  '(counsel-find-file
    (:columns
     ((ivy-read-file-transformer)
      (ivy-rich-counsel-find-file-truename (:face font-lock-doc-face))))
    counsel-M-x
    (:columns
     ((counsel-M-x-transformer (:width 40))
      (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
    counsel-describe-function
    (:columns
     ((counsel-describe-function-transformer (:width 40))
      (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))
    counsel-describe-variable
    (:columns
     ((counsel-describe-variable-transformer (:width 40))
      (ivy-rich-counsel-variable-docstring (:face font-lock-doc-face))))
    counsel-recentf
    (:columns
     ((ivy-rich-candidate (:width 0.8))
      (ivy-rich-file-last-modified-time (:face font-lock-comment-face))))))

(setq ivy-rich-path-style 'abbrev)

  (ivy-rich-mode +1))
    #+END_SRC
****** [[https://github.com/alexmurray/ivy-xref/tree/1a35fc0f070388701b05b0a455cbe262e924d547][ivy-xref: Ivy interface for xref results]]
    #+BEGIN_SRC emacs-lisp
(use-package ivy-xref
  :init (setq xref-show-xrefs-function #'ivy-xref-show-xrefs))
    #+END_SRC
****** ivy-hydra
    #+BEGIN_SRC emacs-lisp
(use-package ivy-hydra
  :after (ivy hydra))
    #+END_SRC
****** ivy-prescient
 #+BEGIN_SRC emacs-lisp
(use-package ivy-prescient
  :after ivy
  :config (ivy-prescient-mode))

 #+END_SRC
***** [[https://github.com/PythonNut/historian.el/tree/64f4ef8cd4e417dfa090138a2d4ea1e72fd4456a][historian: Persistently store selected minibuffer candidates]]
   #+BEGIN_SRC emacs-lisp
(use-package historian
  :commands (historian))
   #+END_SRC
***** [[https://github.com/nonsequitur/smex][smex: M-x Interface with Ido-style fuzzy matching]]
   #+BEGIN_SRC emacs-lisp
(use-package smex
  :config
  (setq smex-save-file (concat dotfiles-cache-dir "/smex-items"))
  (smex-initialize))
   #+END_SRC
***** [[https://github.com/company-mode/company-mode][company: Modular text completion framework]]
    #+BEGIN_SRC emacs-lisp
(use-package company
  :config
  ;; Enable company-mode globally.
  (global-company-mode)
  ;; Except when you're in term-mode.
  (setq company-global-modes '(not term-mode))
  ;; Give Company a decent default configuration.
  (setq company-minimum-prefix-length 2
        company-selection-wrap-around t
        company-show-numbers t
        company-tooltip-align-annotations t
        company-require-match nil
        company-dabbrev-downcase nil
        company-dabbrev-ignore-case nil)
  ;; Sort completion candidates that already occur in the current
  ;; buffer at the top of the candidate list.
  (setq company-transformers '(company-sort-by-occurrence)))
    #+END_SRC
****** company-quickhelp
 #+BEGIN_SRC emacs-lisp
(use-package company-quickhelp
       :config
       (setq company-quickhelp-delay 1)
       (company-quickhelp-mode 1))
 #+END_SRC
****** company-emoji
 #+BEGIN_SRC emacs-lisp
 (use-package company-emoji
       :config
       (company-emoji-init))

 #+END_SRC
****** company-try-hard
 #+BEGIN_SRC emacs-lisp
(use-package company-try-hard
  :commands company-try-hard)

 #+END_SRC
****** company-prescient
 #+BEGIN_SRC emacs-lisp
(use-package company-prescient
  :after company
  :config (company-prescient-mode))

 #+END_SRC
***** Prescient: Sorting and filtering for Emacs
   #+BEGIN_SRC emacs-lisp
(use-package prescient
  :defer t
  :config (prescient-persist-mode))
   #+END_SRC

**** Utilities
***** [[https://github.com/bbatsov/crux/tree/308f17d914e2cd79cbc809de66d02b03ceb82859][crux: Collection of Ridiculously Useful eXtensions]]
   #+BEGIN_SRC emacs-lisp
(use-package crux
  :defer 0.1)
   #+END_SRC
***** [[https://github.com/m00natic/vlfi][vlf: Visits part of large file without loading it entirely]]
   #+BEGIN_SRC emacs-lisp
(use-package vlf
  :commands (vlf))
   #+END_SRC

***** [[https://github.com/bbatsov/super-save/tree/2a905b8bdfc93bee16e2d62a61c6211bbe009331][super-save: Auto-save buffers, based on your activity.]]
   #+BEGIN_SRC emacs-lisp
(use-package super-save)
   #+END_SRC
***** [[https://github.com/dacap/keyfreq/tree/9c665c8c219d18866403897936427bb408e3d6b9][keyfrq: Track command frequencies]]
   #+BEGIN_SRC emacs-lisp
(use-package keyfreq
  :if (eq system-type 'gnu/linux)
  :init
  (keyfreq-mode +1))

   #+END_SRC

