index.html
<li><a id="org3c4062d"></a><a href="https://github.com/Yevgnen/ivy-rich/tree/f6bfa293c6df0b43cc411876b665816ec3f03d08">ivy-rich: More friendly display transformer for ivy</a><br />
<div class="outline-text-6" id="text-2-4-6-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy-rich</span>
  <span style="color: #c678dd;">:config</span>
(<span style="color: #51afef;">setq</span> ivy-rich-display-transformers-list
  '(counsel-find-file
    (<span style="color: #c678dd;">:columns</span>
     ((ivy-read-file-transformer)
      (ivy-rich-counsel-find-file-truename (<span style="color: #c678dd;">:face</span> font-lock-doc-face))))
    counsel-M-x
    (<span style="color: #c678dd;">:columns</span>
     ((counsel-M-x-transformer (<span style="color: #c678dd;">:width</span> 40))
      (ivy-rich-counsel-function-docstring (<span style="color: #c678dd;">:face</span> font-lock-doc-face))))
    counsel-describe-function
    (<span style="color: #c678dd;">:columns</span>
     ((counsel-describe-function-transformer (<span style="color: #c678dd;">:width</span> 40))
      (ivy-rich-counsel-function-docstring (<span style="color: #c678dd;">:face</span> font-lock-doc-face))))
    counsel-describe-variable
    (<span style="color: #c678dd;">:columns</span>
     ((counsel-describe-variable-transformer (<span style="color: #c678dd;">:width</span> 40))
      (ivy-rich-counsel-variable-docstring (<span style="color: #c678dd;">:face</span> font-lock-doc-face))))
    counsel-recentf
    (<span style="color: #c678dd;">:columns</span>
     ((ivy-rich-candidate (<span style="color: #c678dd;">:width</span> 0.8))
      (ivy-rich-file-last-modified-time (<span style="color: #c678dd;">:face</span> font-lock-comment-face))))))

(<span style="color: #51afef;">setq</span> ivy-rich-path-style 'abbrev)

  (ivy-rich-mode +1))
</pre>
</div>
</div>
</li>
<li><a id="org136aa51"></a><a href="https://github.com/alexmurray/ivy-xref/tree/1a35fc0f070388701b05b0a455cbe262e924d547">ivy-xref: Ivy interface for xref results</a><br />
<div class="outline-text-6" id="text-2-4-6-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy-xref</span>
  <span style="color: #c678dd;">:init</span> (<span style="color: #51afef;">setq</span> xref-show-xrefs-function #'ivy-xref-show-xrefs))
</pre>
</div>
</div>
</li>
<li><a id="orgcf0cc86"></a>ivy-hydra<br />
<div class="outline-text-6" id="text-2-4-6-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy-hydra</span>
  <span style="color: #c678dd;">:after</span> (ivy hydra))
</pre>
</div>
</div>
</li>
<li><a id="org41ee872"></a>ivy-prescient<br />
<div class="outline-text-6" id="text-2-4-6-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ivy-prescient</span>
  <span style="color: #c678dd;">:after</span> ivy
  <span style="color: #c678dd;">:config</span> (ivy-prescient-mode))

</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="org5e85e54"></a><a href="https://github.com/PythonNut/historian.el/tree/64f4ef8cd4e417dfa090138a2d4ea1e72fd4456a">historian: Persistently store selected minibuffer candidates</a><br />
<div class="outline-text-5" id="text-2-4-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">historian</span>
  <span style="color: #c678dd;">:commands</span> (historian))
</pre>
</div>
</div>
</li>
<li><a id="orgd8aa758"></a><a href="https://github.com/nonsequitur/smex">smex: M-x Interface with Ido-style fuzzy matching</a><br />
<div class="outline-text-5" id="text-2-4-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">smex</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> smex-save-file (concat dotfiles-cache-dir <span style="color: #98be65;">"/smex-items"</span>))
  (smex-initialize))
</pre>
</div>
</div>
</li>
<li><a id="orgef1a01b"></a><a href="https://github.com/company-mode/company-mode">company: Modular text completion framework</a><br />
<div class="outline-text-5" id="text-2-4-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">company</span>
  <span style="color: #c678dd;">:config</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Enable company-mode globally.</span>
  (global-company-mode)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Except when you're in term-mode.</span>
  (<span style="color: #51afef;">setq</span> company-global-modes '(not term-mode))
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Give Company a decent default configuration.</span>
  (<span style="color: #51afef;">setq</span> company-minimum-prefix-length 2
        company-selection-wrap-around t
        company-show-numbers t
        company-tooltip-align-annotations t
        company-require-match nil
        company-dabbrev-downcase nil
        company-dabbrev-ignore-case nil)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Sort completion candidates that already occur in the current</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">buffer at the top of the candidate list.</span>
  (<span style="color: #51afef;">setq</span> company-transformers '(company-sort-by-occurrence)))
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org3bb7726"></a>company-quickhelp<br />
<div class="outline-text-6" id="text-2-4-6-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">company-quickhelp</span>
       <span style="color: #c678dd;">:config</span>
       (<span style="color: #51afef;">setq</span> company-quickhelp-delay 1)
       (company-quickhelp-mode 1))
</pre>
</div>
</div>
</li>
<li><a id="orgce14cfc"></a>company-emoji<br />
<div class="outline-text-6" id="text-2-4-6-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> (<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">company-emoji</span>
       <span style="color: #c678dd;">:config</span>
       (company-emoji-init))

</pre>
</div>
</div>
</li>
<li><a id="orgb195b69"></a>company-try-hard<br />
<div class="outline-text-6" id="text-2-4-6-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">company-try-hard</span>
  <span style="color: #c678dd;">:commands</span> company-try-hard)

</pre>
</div>
</div>
</li>
<li><a id="org95eb8f8"></a>company-prescient<br />
<div class="outline-text-6" id="text-2-4-6-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">company-prescient</span>
  <span style="color: #c678dd;">:after</span> company
  <span style="color: #c678dd;">:config</span> (company-prescient-mode))

</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="org5639c48"></a>Prescient: Sorting and filtering for Emacs<br />
<div class="outline-text-5" id="text-2-4-6-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">prescient</span>
  <span style="color: #c678dd;">:defer</span> t
  <span style="color: #c678dd;">:config</span> (prescient-persist-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf864bba" class="outline-4">
<h4 id="orgf864bba"><span class="section-number-4">2.4.7</span> Utilities</h4>
<div class="outline-text-4" id="text-2-4-7">
</div>
<ol class="org-ol">
<li><a id="orgc5b3ac1"></a><a href="https://github.com/bbatsov/crux/tree/308f17d914e2cd79cbc809de66d02b03ceb82859">crux: Collection of Ridiculously Useful eXtensions</a><br />
<div class="outline-text-5" id="text-2-4-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">crux</span>
  <span style="color: #c678dd;">:defer</span> 0.1)
</pre>
</div>
</div>
</li>
<li><a id="org0dbf850"></a><a href="https://github.com/m00natic/vlfi">vlf: Visits part of large file without loading it entirely</a><br />
<div class="outline-text-5" id="text-2-4-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">vlf</span>
  <span style="color: #c678dd;">:commands</span> (vlf))
</pre>
</div>
</div>
</li>

<li><a id="org270fbf7"></a><a href="https://github.com/bbatsov/super-save/tree/2a905b8bdfc93bee16e2d62a61c6211bbe009331">super-save: Auto-save buffers, based on your activity.</a><br />
<div class="outline-text-5" id="text-2-4-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">super-save</span>)
</pre>
</div>
</div>
</li>
<li><a id="org0727e4d"></a><a href="https://github.com/dacap/keyfreq/tree/9c665c8c219d18866403897936427bb408e3d6b9">keyfrq: Track command frequencies</a><br />
<div class="outline-text-5" id="text-2-4-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">keyfreq</span>
  <span style="color: #c678dd;">:if</span> (eq system-type 'gnu/linux)
  <span style="color: #c678dd;">:init</span>
  (keyfreq-mode +1))

</pre>
</div>
</div>
</li>
