config.org
***** [[https://github.com/sshaw/copy-as-format/tree/a0962b670e26b723ce304b14e3397da453aef84e][copy-as-format: Copy text as GitHub/Slack/JIRA/HipChat/... formatted code]]
   #+BEGIN_SRC emacs-lisp
(use-package copy-as-format
  :bind (:map mode-specific-map
              :prefix-map copy-as-format-prefix-map
              :prefix "w"
              ("w" . copy-as-format)
              ("g" . copy-as-format-github)
              ("h" . copy-as-format-hipchat-pidgin)
              ("j" . copy-as-format-jira)
              ("m" . copy-as-format-markdown)
              ("o" . copy-as-format-org-mode)
              ("r" . copy-as-format-rst)
              ("s" . copy-as-format-slack)
              ("v" . org-copy-visible))
  :config
  ;; (setq copy-as-format-default "slack")
  ;; Define own format since pidgin doesn't allow to begin a message with `/code'
  (defun copy-as-format--hipchat-pidgin (text _multiline)
    (format "/say /code %s" text))
  (add-to-list 'copy-as-format-format-alist '("hipchat-pidgin" copy-as-format--hipchat-pidgin))
  (defun copy-as-format-hipchat-pidgin ()
    (interactive)
    (setq copy-as-format-default "hipchat-pidgin")
    (copy-as-format)))
   #+END_SRC

***** [[https://www.emacswiki.org/emacs/RecentFiles][recentf: Builds a list of recently opened files]]
   #+BEGIN_SRC emacs-lisp
(use-package recentf
  :config
  (setq recentf-save-file (concat dotfiles-etc-dir "recentf")
        recentf-max-menu-items 0
        recentf-max-saved-items 100)
  (recentf-mode))

   #+END_SRC

***** hideshow
 #+BEGIN_SRC emacs-lisp
(use-package hideshow
  :hook (prog-mode  . hs-minor-mode))
 #+END_SRC
***** outline
 #+BEGIN_SRC emacs-lisp
(use-package outline
  :hook ((prog-mode message-mode markdown-mode) . outline-minor-mode))
 #+END_SRC
***** bicyle
      #+BEGIN_SRC emacs-lisp
(use-package bicycle
  :after outline
  :bind (:map outline-minor-mode-map
              ([C-tab] . bicycle-cycle)
              ([backtab] . bicycle-cycle-global)))
      #+END_SRC

***** elmacro
    #+BEGIN_SRC emacs-lisp
(use-package elmacro
  :commands elmacro-mode)
    #+END_SRC
*** Project Management
**** [[https://github.com/bbatsov/projectile/tree/fd85829ef2bdb8b2c183ea1b3ccfd50925824d78][projectile: Manage and navigate projects in Emacs easily]]
      #+BEGIN_SRC emacs-lisp
(use-package projectile
  :custom
  (projectile-use-git-grep t)
  (projectile-create-missing-test-files t)
  (projectile-completion-system 'ivy)
  (projectile-switch-project-action  #'projectile-commander)
  (projectile-discover-projects-in-search-path "~/org/projects")
  :config
  (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)
  (projectile-mode +1)
  (counsel-projectile-mode +1)
  (def-projectile-commander-method ?S
    "Run a search in the project"
    (counsel-projectile-rg))
  (def-projectile-commander-method ?s
    "Open a *eshell* buffer for the project."
    (projectile-run-eshell))
  (def-projectile-commander-method ?d
    "Open project root in dired."
    (projectile-dired))
  (def-projectile-commander-method ?g
    "Show magit status."
    (magit-status)))

   #+END_SRC
**** [[https://github.com/purcell/ibuffer-projectile/tree/76496214144687cee0b5139be2e61b1e400cac87][ibuffer-projectile: Group ibuffer's list by projectile root]]
  #+BEGIN_SRC emacs-lisp
(use-package ibuffer-projectile
  :config
  (add-hook 'ibuffer-hook
            (lambda ()
              (ibuffer-projectile-set-filter-groups)
              (unless (eq ibuffer-sorting-mode 'alphabetic)
                (ibuffer-do-sort-by-alphabetic)))))
     #+END_SRC

*** Version Control
**** [[https://github.com/magit/magit/tree/0984d77fbdae0fe85b38dd27036318212b9a1e5d][magit: Interface to the version control system Git]]
  implemented as an Emacs package
     #+BEGIN_SRC emacs-lisp
(use-package magit
  :commands magit-status
  :bind ("C-x g" . magit-status))
   #+END_SRC
**** [[https://melpa.org/#/gist][gist: Emacs integration for gist.github.com]]
  #+BEGIN_SRC emacs-lisp
(use-package gist
  :commands gist-mode)
  #+END_SRC
**** [[https://gitlab.com/pidu/git-timemachine/tree/b97f93d66cffcd69281346845d3a1e32197eda29][git-timemachine: Walk through git revisions of a file]]
  #+BEGIN_SRC emacs-lisp
(use-package git-timemachine
  :commands git-timemachine)
  #+END_SRC
**** gitpatch
  #+BEGIN_SRC emacs-lisp
(use-package gitpatch
  :defer t)
  #+END_SRC

*** Languages
