index.html

<li><a id="orgbc3ae3c"></a><a href="https://github.com/sshaw/copy-as-format/tree/a0962b670e26b723ce304b14e3397da453aef84e">copy-as-format: Copy text as GitHub/Slack/JIRA/HipChat/&#x2026; formatted code</a><br />
<div class="outline-text-5" id="text-2-4-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">copy-as-format</span>
  <span style="color: #c678dd;">:bind</span> (<span style="color: #c678dd;">:map</span> mode-specific-map
              <span style="color: #c678dd;">:prefix-map</span> copy-as-format-prefix-map
              <span style="color: #c678dd;">:prefix</span> <span style="color: #98be65;">"w"</span>
              (<span style="color: #98be65;">"w"</span> . copy-as-format)
              (<span style="color: #98be65;">"g"</span> . copy-as-format-github)
              (<span style="color: #98be65;">"h"</span> . copy-as-format-hipchat-pidgin)
              (<span style="color: #98be65;">"j"</span> . copy-as-format-jira)
              (<span style="color: #98be65;">"m"</span> . copy-as-format-markdown)
              (<span style="color: #98be65;">"o"</span> . copy-as-format-org-mode)
              (<span style="color: #98be65;">"r"</span> . copy-as-format-rst)
              (<span style="color: #98be65;">"s"</span> . copy-as-format-slack)
              (<span style="color: #98be65;">"v"</span> . org-copy-visible))
  <span style="color: #c678dd;">:config</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(setq copy-as-format-default "slack")</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Define own format since pidgin doesn't allow to begin a message with `</span><span style="color: #a9a1e1;">/code</span><span style="color: #5B6268;">'</span>
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">copy-as-format--hipchat-pidgin</span> (text _multiline)
    (format <span style="color: #98be65;">"/say /code %s"</span> text))
  (add-to-list 'copy-as-format-format-alist '(<span style="color: #98be65;">"hipchat-pidgin"</span> copy-as-format--hipchat-pidgin))
  (<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">copy-as-format-hipchat-pidgin</span> ()
    (<span style="color: #51afef;">interactive</span>)
    (<span style="color: #51afef;">setq</span> copy-as-format-default <span style="color: #98be65;">"hipchat-pidgin"</span>)
    (copy-as-format)))
</pre>
</div>
</div>
</li>

<li><a id="org878cf5f"></a><a href="https://www.emacswiki.org/emacs/RecentFiles">recentf: Builds a list of recently opened files</a><br />
<div class="outline-text-5" id="text-2-4-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">recentf</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">setq</span> recentf-save-file (concat dotfiles-etc-dir <span style="color: #98be65;">"recentf"</span>)
        recentf-max-menu-items 0
        recentf-max-saved-items 100)
  (recentf-mode))

</pre>
</div>
</div>
</li>

<li><a id="org8d5869c"></a>hideshow<br />
<div class="outline-text-5" id="text-2-4-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">hideshow</span>
  <span style="color: #c678dd;">:hook</span> (prog-mode  . hs-minor-mode))
</pre>
</div>
</div>
</li>
<li><a id="orgdfae36f"></a>outline<br />
<div class="outline-text-5" id="text-2-4-7-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">outline</span>
  <span style="color: #c678dd;">:hook</span> ((prog-mode message-mode markdown-mode) . outline-minor-mode))
</pre>
</div>
</div>
</li>
<li><a id="orgb5da1fc"></a>bicyle<br />
<div class="outline-text-5" id="text-2-4-7-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">bicycle</span>
  <span style="color: #c678dd;">:after</span> outline
  <span style="color: #c678dd;">:bind</span> (<span style="color: #c678dd;">:map</span> outline-minor-mode-map
              ([C-tab] . bicycle-cycle)
              ([backtab] . bicycle-cycle-global)))
</pre>
</div>
</div>
</li>

<li><a id="orge480c52"></a>elmacro<br />
<div class="outline-text-5" id="text-2-4-7-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">elmacro</span>
  <span style="color: #c678dd;">:commands</span> elmacro-mode)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org874374d" class="outline-3">
<h3 id="org874374d"><span class="section-number-3">2.5</span> Project Management</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org5c1d7fb" class="outline-4">
<h4 id="org5c1d7fb"><span class="section-number-4">2.5.1</span> <a href="https://github.com/bbatsov/projectile/tree/fd85829ef2bdb8b2c183ea1b3ccfd50925824d78">projectile: Manage and navigate projects in Emacs easily</a></h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">projectile</span>
  <span style="color: #c678dd;">:custom</span>
  (projectile-use-git-grep t)
  (projectile-create-missing-test-files t)
  (projectile-completion-system 'ivy)
  (projectile-switch-project-action  #'projectile-commander)
  (projectile-discover-projects-in-search-path <span style="color: #98be65;">"~/org/projects"</span>)
  <span style="color: #c678dd;">:config</span>
  (define-key projectile-mode-map (kbd <span style="color: #98be65;">"C-x p"</span>) 'projectile-command-map)
  (projectile-mode +1)
  (counsel-projectile-mode +1)
  (<span style="color: #51afef;">def-projectile-commander-method</span> ?S
    <span style="color: #98be65;">"Run a search in the project"</span>
    (counsel-projectile-rg))
  (<span style="color: #51afef;">def-projectile-commander-method</span> ?s
    <span style="color: #98be65;">"Open a *eshell* buffer for the project."</span>
    (projectile-run-eshell))
  (<span style="color: #51afef;">def-projectile-commander-method</span> ?d
    <span style="color: #98be65;">"Open project root in dired."</span>
    (projectile-dired))
  (<span style="color: #51afef;">def-projectile-commander-method</span> ?g
    <span style="color: #98be65;">"Show magit status."</span>
    (magit-status)))

</pre>
</div>
</div>
</div>
<div id="outline-container-orge6418b2" class="outline-4">
<h4 id="orge6418b2"><span class="section-number-4">2.5.2</span> <a href="https://github.com/purcell/ibuffer-projectile/tree/76496214144687cee0b5139be2e61b1e400cac87">ibuffer-projectile: Group ibuffer's list by projectile root</a></h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ibuffer-projectile</span>
  <span style="color: #c678dd;">:config</span>
  (add-hook 'ibuffer-hook
            (<span style="color: #51afef;">lambda</span> ()
              (ibuffer-projectile-set-filter-groups)
              (<span style="color: #51afef;">unless</span> (eq ibuffer-sorting-mode 'alphabetic)
                (ibuffer-do-sort-by-alphabetic)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe1b8dc" class="outline-3">
<h3 id="orgbe1b8dc"><span class="section-number-3">2.6</span> Version Control</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgdf3325a" class="outline-4">
<h4 id="orgdf3325a"><span class="section-number-4">2.6.1</span> <a href="https://github.com/magit/magit/tree/0984d77fbdae0fe85b38dd27036318212b9a1e5d">magit: Interface to the version control system Git</a></h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
implemented as an Emacs package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">magit</span>
  <span style="color: #c678dd;">:commands</span> magit-status
  <span style="color: #c678dd;">:bind</span> (<span style="color: #98be65;">"C-x g"</span> . magit-status))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0173b14" class="outline-4">
<h4 id="org0173b14"><span class="section-number-4">2.6.2</span> <a href="https://melpa.org/#/gist">gist: Emacs integration for gist.github.com</a></h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">gist</span>
  <span style="color: #c678dd;">:commands</span> gist-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org24669e8" class="outline-4">
<h4 id="org24669e8"><span class="section-number-4">2.6.3</span> <a href="https://gitlab.com/pidu/git-timemachine/tree/b97f93d66cffcd69281346845d3a1e32197eda29">git-timemachine: Walk through git revisions of a file</a></h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">git-timemachine</span>
  <span style="color: #c678dd;">:commands</span> git-timemachine)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga136c19" class="outline-4">
<h4 id="orga136c19"><span class="section-number-4">2.6.4</span> gitpatch</h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">gitpatch</span>
  <span style="color: #c678dd;">:defer</span> t)
</pre>
</div>
</div>
</div>
</div>
