config.org
**** [[https://orgmode.org/guide/][org-mode: a powerful system for organizing your complex life with simple plain-text files]]

  Org-mode is a powerful system for organizing your complex life with simple plain-text files. It seamlessly integrates all your notes, mindmaps, TODO lists, calendar, day planner, and project schedules into a single system that can be easily searched (e.g. by grep), encrypted (e.g. by GnuPG), backed up and synced (e.g. by Dropbox), imported/exported, and accessed on the go (e.g. on an iPhone or Android smartphone). It can even be used for authoring web pages and documents.
    #+BEGIN_SRC emacs-lisp
(use-package org
  :ensure org-plus-contrib
  :ensure t
  :bind(("C-x C-k" . org-cut-subtree))
  :config
(require 'org-agenda)
  ;; Stop org-mode from highjacking shift-cursor keys.
  (setq org-replace-disputed-keys t)
  ;; Always use visual-line-mode in org-mode, and wrap it at column 80.
  (add-hook
   'org-mode-hook
   (lambda ()
     (visual-line-mode 1)))


  (setq org-hide-leading-stars t)
  (setq org-hide-emphasis-markers t)

  (setq org-list-allow-alphabetical t)

  (setq org-startup-with-inline-images t)
  (setq org-startup-folded t)
  (setq org-agenda-sticky t)

  (setq org-ellipsis "⤵")


(setq org-list-demote-modify-bullet (quote (("+" . "-")
                                              ("*" . "-")
                                              ("1." . "-")
                                              ("1)" . "-")
                                              ("A)" . "-")
                                              ("B)" . "-")
                                              ("a)" . "-")
                                              ("b)" . "-")
                                              ("A." . "-")
                                              ("B." . "-")
                                              ("a." . "-")
                                              ("b." . "-"))))

  )

  #+END_SRC
***** agenda functions
   #+BEGIN_SRC emacs-lisp
(define-advice org-capture-refile (:around (oldfunc &rest args) org-disable-log-refile)
  "Set `org-log-refile' to nil while capturing."
  (let ((org-log-refile nil))
    (apply oldfunc args)))

(add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)

(defun my/org-goto-current-datetree-entry ()
  "Open current day in log.org datetree in indirect buffer.  With prefix, open in real buffer."
  (interactive)
  (let* ((filename org-file-journal)
         (buffer (or (org-find-base-buffer-visiting filename)
                     (find-file-noselect filename)
                     (error "Unable to find buffer for file: %s" filename))))
    (switch-to-buffer buffer)
    (org-set-startup-visibility)
    (org-datetree-find-date-create (list (string-to-number (format-time-string "%m"))
                                         (string-to-number (format-time-string "%d"))
                                         (string-to-number (format-time-string "%Y"))))
    (org-cycle)
    (unless current-prefix-arg
      (org-narrow-to-subtree))))


(defun my/org-agenda-switch-to()
  "Jumps to a specific task."
  (interactive)
  (call-interactively 'org-agenda-switch-to)
  (org-cycle)
  (org-narrow-to-subtree)
  (outline-show-branches))


(define-key org-agenda-mode-map (kbd "RET") 'my/org-agenda-switch-to)

(defun my/org-agenda-goto-narrow ()
  "Jumps to a specific task."
  (interactive)
  (call-interactively 'org-agenda-goto)
  (org-narrow-to-subtree)
  (outline-show-branches))

(define-key org-agenda-mode-map (kbd "<tab>") 'my/org-agenda-goto-narrow)

;; Record time and note when the scheduled date of a task is modified
(setq org-log-reschedule 'note)

;; Record time and note when the deadline of a task is modified
(setq org-log-redeadline 'note)

;; Record time and note when clocking out of a task
(setq org-log-clock-out 'note)

;; Record time and note when a task is refiled
(defvar org-blocks-hidden nil)

   #+END_SRC

***** export settings
 #+BEGIN_SRC emacs-lisp
(setq org-export-backends '(ascii html icalendar latex org odt md))

(setq org-agenda-exporter-settings
      '((ps-number-of-columns 2)
        (ps-landscape-mode t)
        (org-agenda-add-entry-text-maxlines 5)
        (htmlize-output-type 'css)))
 #+END_SRC
***** org-attach
   #+BEGIN_SRC emacs-lisp
(setq org-attach-auto-tag nil)
(setq org-attach-method 'mv)

(defun org-insert-file (fiename)
  "Insert Elisp code block recreating file named FILENAME."
  (interactive "f")
  (let ((base64-string
         (with-temp-buffer
           (insert-file-contents-literally filename)
           (base64-encode-region (point-min) (point-max))
           (buffer-string))))
    (insert (format "#+BEGIN_SRC emacs-lisp :results output silent\n  (with-temp-file %S\n    (insert (base64-decode-string\n      %S)))\n#+END_SRC" filename base64-string))))

(defun my/org-attach-download (url)
  "Download file at URL and attach with `org-attach'.
Interactively, look for URL at point, in X clipboard, and in
kill-ring, prompting if not found.  With prefix, prompt for URL."
  (interactive (list (if current-prefix-arg
                         (read-string "URL: ")
                       (or (org-element-property :raw-link (org-element-context))
                           (org-web-tools--get-first-url)
                           (read-string "URL: ")))))
  (when (yes-or-no-p (concat "Attach file at URL: " url))
    (let* ((temp-dir (make-temp-file "org-attach-download-" 'dir))
           (basename (file-name-nondirectory (directory-file-name url)))
           (local-path (expand-file-name basename temp-dir))
           size)
      (unwind-protect
          (progn
            (url-copy-file url local-path 'ok-if-exists 'keep-time)
            (setq size (file-size-human-readable
                        (file-attribute-size
                         (file-attributes local-path))))
            (org-attach-attach local-path nil 'mv)
            (message "Attached %s (%s)" url size))
        (delete-directory temp-dir)))))


   #+END_SRC
***** packages
