index.html

<div id="outline-container-org20c6a72" class="outline-3">
<h3 id="org20c6a72"><span class="section-number-3">2.7</span> Languages</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgd90d365" class="outline-4">
<h4 id="orgd90d365"><span class="section-number-4">2.7.1</span> <a href="https://orgmode.org/guide/">org-mode: a powerful system for organizing your complex life with simple plain-text files</a></h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Org-mode is a powerful system for organizing your complex life with simple plain-text files. It seamlessly integrates all your notes, mindmaps, TODO lists, calendar, day planner, and project schedules into a single system that can be easily searched (e.g. by grep), encrypted (e.g. by GnuPG), backed up and synced (e.g. by Dropbox), imported/exported, and accessed on the go (e.g. on an iPhone or Android smartphone). It can even be used for authoring web pages and documents.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">org</span>
  <span style="color: #c678dd;">:ensure</span> org-plus-contrib
  <span style="color: #c678dd;">:bind</span>((<span style="color: #98be65;">"C-x C-k"</span> . org-cut-subtree))
  <span style="color: #c678dd;">:config</span>
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Stop org-mode from highjacking shift-cursor keys.</span>
  (<span style="color: #51afef;">setq</span> org-replace-disputed-keys t)
  <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Always use visual-line-mode in org-mode, and wrap it at column 80.</span>
  (add-hook
   'org-mode-hook
   (<span style="color: #51afef;">lambda</span> ()
     (visual-line-mode 1)))


  (<span style="color: #51afef;">setq</span> org-hide-leading-stars t)
  (<span style="color: #51afef;">setq</span> org-hide-emphasis-markers t)

  (<span style="color: #51afef;">setq</span> org-list-allow-alphabetical t)

  (<span style="color: #51afef;">setq</span> org-startup-with-inline-images t)
  (<span style="color: #51afef;">setq</span> org-startup-folded t)
  (<span style="color: #51afef;">setq</span> org-agenda-sticky t)


  )

</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orgf487dac"></a>agenda functions<br />
<div class="outline-text-5" id="text-2-7-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Disable when refiled from org-capture</span>
(<span style="color: #51afef;">define-advice</span> <span style="color: #c678dd;">org-capture-refile</span> (<span style="color: #c678dd;">:around</span> (oldfunc <span style="color: #ECBE7B;">&amp;rest</span> args) org-disable-log-refile)
  <span style="color: #83898d;">"Set `</span><span style="color: #a9a1e1;">org-log-refile</span><span style="color: #83898d;">' to nil while capturing."</span>
  (<span style="color: #51afef;">let</span> ((org-log-refile nil))
    (apply oldfunc args)))

(add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-goto-current-datetree-entry</span> ()
  <span style="color: #83898d;">"Open current day in log.org datetree in indirect buffer.  With prefix, open in real buffer."</span>
  (<span style="color: #51afef;">interactive</span>)
  (<span style="color: #51afef;">let*</span> ((filename org-file-journal)
         (buffer (<span style="color: #51afef;">or</span> (org-find-base-buffer-visiting filename)
                     (find-file-noselect filename)
                     (<span style="color: #ECBE7B;">error</span> <span style="color: #98be65;">"Unable to find buffer for file: %s"</span> filename))))
    (switch-to-buffer buffer)
    (org-set-startup-visibility)
    (org-datetree-find-date-create (list (string-to-number (format-time-string <span style="color: #98be65;">"%m"</span>))
                                         (string-to-number (format-time-string <span style="color: #98be65;">"%d"</span>))
                                         (string-to-number (format-time-string <span style="color: #98be65;">"%Y"</span>))))
    (org-cycle)
    (<span style="color: #51afef;">unless</span> current-prefix-arg
      (org-narrow-to-subtree))))


(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-agenda-switch-to</span>()
  <span style="color: #83898d;">"Jumps to a specific task."</span>
  (<span style="color: #51afef;">interactive</span>)
  (call-interactively 'org-agenda-switch-to)
  (org-cycle)
  (org-narrow-to-subtree)
  (outline-show-branches))

(define-key org-agenda-mode-map (kbd <span style="color: #98be65;">"RET"</span>) 'my/org-agenda-switch-to)

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-agenda-goto-narrow</span> ()
  <span style="color: #83898d;">"Jumps to a specific task."</span>
  (<span style="color: #51afef;">interactive</span>)
  (call-interactively 'org-agenda-goto)
  (org-narrow-to-subtree)
  (outline-show-branches))

(define-key org-agenda-mode-map (kbd <span style="color: #98be65;">"&lt;tab&gt;"</span>) 'my/org-agenda-goto-narrow)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Record time and note when the scheduled date of a task is modified</span>
(<span style="color: #51afef;">setq</span> org-log-reschedule 'note)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Record time and note when the deadline of a task is modified</span>
(<span style="color: #51afef;">setq</span> org-log-redeadline 'note)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Record time and note when clocking out of a task</span>
(<span style="color: #51afef;">setq</span> org-log-clock-out 'note)

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">Record time and note when a task is refiled</span>
(<span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">org-blocks-hidden</span> nil)

</pre>
</div>
</div>
</li>

<li><a id="org8e51dcc"></a>export settings<br />
<div class="outline-text-5" id="text-2-7-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> org-export-backends '(ascii html icalendar latex org odt md))

(<span style="color: #51afef;">setq</span> org-agenda-exporter-settings
      '((ps-number-of-columns 2)
        (ps-landscape-mode t)
        (org-agenda-add-entry-text-maxlines 5)
        (htmlize-output-type 'css)))
</pre>
</div>
</div>
</li>
<li><a id="orgcebbd8c"></a>org-attach<br />
<div class="outline-text-5" id="text-2-7-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">setq</span> org-attach-auto-tag nil)
(<span style="color: #51afef;">setq</span> org-attach-method 'mv)

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">org-insert-file</span> (fiename)
  <span style="color: #83898d;">"Insert Elisp code block recreating file named FILENAME."</span>
  (<span style="color: #51afef;">interactive</span> <span style="color: #98be65;">"f"</span>)
  (<span style="color: #51afef;">let</span> ((base64-string
         (<span style="color: #51afef;">with-temp-buffer</span>
           (insert-file-contents-literally filename)
           (base64-encode-region (point-min) (point-max))
           (buffer-string))))
    (insert (format <span style="color: #98be65;">"#+BEGIN_SRC emacs-lisp :results output silent\n  (with-temp-file %S\n    (insert (base64-decode-string\n      %S)))\n#+END_SRC"</span> filename base64-string))))

(<span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my/org-attach-download</span> (url)
  <span style="color: #83898d;">"Download file at URL and attach with `</span><span style="color: #a9a1e1;">org-attach</span><span style="color: #83898d;">'.</span>
<span style="color: #83898d;">Interactively, look for URL at point, in X clipboard, and in</span>
<span style="color: #83898d;">kill-ring, prompting if not found.  With prefix, prompt for URL."</span>
  (<span style="color: #51afef;">interactive</span> (list (<span style="color: #51afef;">if</span> current-prefix-arg
                         (read-string <span style="color: #98be65;">"URL: "</span>)
                       (<span style="color: #51afef;">or</span> (org-element-property <span style="color: #c678dd;">:raw-link</span> (org-element-context))
                           (org-web-tools--get-first-url)
                           (read-string <span style="color: #98be65;">"URL: "</span>)))))
  (<span style="color: #51afef;">when</span> (yes-or-no-p (concat <span style="color: #98be65;">"Attach file at URL: "</span> url))
    (<span style="color: #51afef;">let*</span> ((temp-dir (make-temp-file <span style="color: #98be65;">"org-attach-download-"</span> 'dir))
           (basename (file-name-nondirectory (directory-file-name url)))
           (local-path (expand-file-name basename temp-dir))
           size)
      (<span style="color: #51afef;">unwind-protect</span>
          (<span style="color: #51afef;">progn</span>
            (url-copy-file url local-path 'ok-if-exists 'keep-time)
            (<span style="color: #51afef;">setq</span> size (file-size-human-readable
                        (file-attribute-size
                         (file-attributes local-path))))
            (org-attach-attach local-path nil 'mv)
            (message <span style="color: #98be65;">"Attached %s (%s)"</span> url size))
        (delete-directory temp-dir)))))


</pre>
</div>
</div>
</li>
