config.org
****** [[https://github.com/rexim/org-cliplink/tree/82402cae7e118d67de7328417fd018a18f95fac2][org-cliplink: Insert org-mode links from the clipboard]]
     #+BEGIN_SRC emacs-lisp
(use-package org-cliplink
  :commands org-cliplink)
     #+END_SRC
****** [[https://github.com/abo-abo/org-download/tree/ac72bf8fce3e855da60687027b6b8601cf1de480][org-download: Image drag-and-drop for Emacs org-mode]]
     #+BEGIN_SRC emacs-lisp
(use-package org-download
  :commands (org-download-screenshot org-download-yank)
  :init
  (setq org-download-method 'attach)
  (setq org-image-actual-width 600))

     #+END_SRC
****** [[https://github.com/bastibe/org-journal/tree/159794a3f5f28eeab8f87a0378d81d0b2d2cb6fc][org-journal: a simple org-mode based journaling mode]]
     #+BEGIN_SRC emacs-lisp
(use-package org-journal
  :commands (org-journal-new-entry)
  :init
  (setq org-journal-file-format "%Y-%m-%d.org"))
     #+END_SRC
****** [[https://github.com/snosov1/toc-org/tree/2539b4be401d006e2752f6ad3b88e696889a7fc8][toc-org: up-to-date table of contents in org files without exporting]]
    #+BEGIN_SRC emacs-lisp
(use-package toc-org
  :ensure t
  :config
  (add-hook 'org-mode-hook 'toc-org-mode))
    #+END_SRC
****** org-pomodoro
     #+BEGIN_SRC emacs-lisp
(use-package org-pomodoro
  :commands org-pomodoro)
     #+END_SRC
**** Markup
***** [[https://github.com/larstvei/ox-gfm/tree/99f93011b069e02b37c9660b8fcb45dab086a07f][ox-gfm: Github Flavored Markdown Back-End for Org Export Engine]]
   #+BEGIN_SRC emacs-lisp
(use-package ox-gfm)
   #+END_SRC
***** [[https://github.com/jrblevin/markdown-mode/tree/115f77df9755c6a453f3e5d9623ff885d207ea82][markdown-mode: Major mode for Markdown-formatted text]]
    #+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :commands markdown-mode
  :mode (("\\.markdown$" . markdown-mode)
         ("\\.md$" . markdown-mode))
  :config
  (add-hook 'markdown-mode-hook 'visual-line-mode))
    #+END_SRC
**** Epub
***** Nov: Read EPUBs
   #+BEGIN_SRC emacs-lisp
(use-package nov
  :mode ("\\.epub\\'" . nov-mode))
   #+END_SRC
**** Utilities
***** [[https://github.com/ieure/scratch-el][scratch: Create scratch buffers that are in the same mode as the current buffer]]
    #+BEGIN_SRC emacs-lisp
(use-package scratch
  :commands
  (scratch))
    #+END_SRC
***** [[https://github.com/Fanael/persistent-scratch/tree/71371a7ce9846754276350fd577dc7543eb52878][persistent-scratch: Preserve the scratch buffer across Emacs sessions]]
   #+BEGIN_SRC emacs-lisp
(use-package persistent-scratch
  :init
  (persistent-scratch-setup-default))
   #+END_SRC
***** [[https://github.com/EricCrosson/unkillable-scratch/tree/b24c2a760529833f230c14cb02ff6e7ec92288ab][unkillable-scratch: Disallow the scratch buffer from being killed]]
    #+BEGIN_SRC emacs-lisp
(use-package unkillable-scratch
  :ensure t
  :config
  (unkillable-scratch t)
  (setq unkillable-scratch-do-not-reset-scratch-buffer t))
    #+END_SRC
***** [[https://github.com/joaotavora/yasnippet/tree/e45e3de357fbd4289fcfa3dd26aaa7be357fb0b8][yasnippet: Snippet Extension for Emacs]]
    #+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :commands (yas-insert-snippet)
  :config
  (yas-global-mode 1))
    #+END_SRC
***** [[https://github.com/AndreaCrotti/yasnippet-snippets/tree/15e4b08f7484c049d6b043263c5e09bc73846e32][yasnippet-snippet: Collection of yasnippet snippets]]
   #+BEGIN_SRC emacs-lisp
(use-package yasnippet-snippets
  :config
  (require 'yasnippet-snippets))
   #+END_SRC
***** [[https://github.com/abo-abo/auto-yasnippet/tree/624b0d9711222073a2a3f2186e2605eb99fc83c9][auto-yasnippet: Quickly create disposable yasnippets]]
   #+BEGIN_SRC emacs-lisp
(use-package auto-yasnippet
  :config
  (require 'auto-yasnippet))
   #+END_SRC
***** [[https://github.com/hniksic/emacs-htmlize/tree/8db0aa6aab77475a732b7363f0d57bd3933c18fd][htmlize: Convert buffer text and decorations to HTML]]
   #+BEGIN_SRC emacs-lisp
(use-package htmlize)
   #+END_SRC
*** new test
    :PROPERTIES:
    :CREATED:  [2019-06-18 Tue 15:40]
    :END:
