index.html
<li><a id="orgcb3e265"></a>packages<br />
<ol class="org-ol">
<li><a id="org8694bcd"></a><a href="https://github.com/rexim/org-cliplink/tree/82402cae7e118d67de7328417fd018a18f95fac2">org-cliplink: Insert org-mode links from the clipboard</a><br />
<div class="outline-text-6" id="text-2-7-1-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">org-cliplink</span>
  <span style="color: #c678dd;">:commands</span> org-cliplink)
</pre>
</div>
</div>
</li>
<li><a id="org6b72c29"></a><a href="https://github.com/abo-abo/org-download/tree/ac72bf8fce3e855da60687027b6b8601cf1de480">org-download: Image drag-and-drop for Emacs org-mode</a><br />
<div class="outline-text-6" id="text-2-7-1-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">org-download</span>
  <span style="color: #c678dd;">:commands</span> (org-download-screenshot org-download-yank)
  <span style="color: #c678dd;">:init</span>
  (<span style="color: #51afef;">setq</span> org-download-method 'attach)
  (<span style="color: #51afef;">setq</span> org-image-actual-width 600))

</pre>
</div>
</div>
</li>
<li><a id="org610f8ba"></a><a href="https://github.com/bastibe/org-journal/tree/159794a3f5f28eeab8f87a0378d81d0b2d2cb6fc">org-journal: a simple org-mode based journaling mode</a><br />
<div class="outline-text-6" id="text-2-7-1-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">org-journal</span>
  <span style="color: #c678dd;">:commands</span> (org-journal-new-entry)
  <span style="color: #c678dd;">:init</span>
  (<span style="color: #51afef;">setq</span> org-journal-file-format <span style="color: #98be65;">"%Y-%m-%d.org"</span>))
</pre>
</div>
</div>
</li>
<li><a id="org770fed9"></a><a href="https://github.com/snosov1/toc-org/tree/2539b4be401d006e2752f6ad3b88e696889a7fc8">toc-org: up-to-date table of contents in org files without exporting</a><br />
<div class="outline-text-6" id="text-2-7-1-4-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">toc-org</span>
  <span style="color: #c678dd;">:ensure</span> t
  <span style="color: #c678dd;">:config</span>
  (add-hook 'org-mode-hook 'toc-org-mode))
</pre>
</div>
</div>
</li>
<li><a id="org4ea0f52"></a>org-pomodoro<br />
<div class="outline-text-6" id="text-2-7-1-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">org-pomodoro</span>
  <span style="color: #c678dd;">:commands</span> org-pomodoro)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgcd5b346" class="outline-4">
<h4 id="orgcd5b346"><span class="section-number-4">2.7.2</span> Markup</h4>
<div class="outline-text-4" id="text-2-7-2">
</div>
<ol class="org-ol">
<li><a id="org0eeeed1"></a><a href="https://github.com/larstvei/ox-gfm/tree/99f93011b069e02b37c9660b8fcb45dab086a07f">ox-gfm: Github Flavored Markdown Back-End for Org Export Engine</a><br />
<div class="outline-text-5" id="text-2-7-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">ox-gfm</span>)
</pre>
</div>
</div>
</li>
<li><a id="org072d2ab"></a><a href="https://github.com/jrblevin/markdown-mode/tree/115f77df9755c6a453f3e5d9623ff885d207ea82">markdown-mode: Major mode for Markdown-formatted text</a><br />
<div class="outline-text-5" id="text-2-7-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">markdown-mode</span>
  <span style="color: #c678dd;">:commands</span> markdown-mode
  <span style="color: #c678dd;">:mode</span> ((<span style="color: #98be65;">"\\.markdown$"</span> . markdown-mode)
         (<span style="color: #98be65;">"\\.md$"</span> . markdown-mode))
  <span style="color: #c678dd;">:config</span>
  (add-hook 'markdown-mode-hook 'visual-line-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org49a3a46" class="outline-4">
<h4 id="org49a3a46"><span class="section-number-4">2.7.3</span> Utilities</h4>
<div class="outline-text-4" id="text-2-7-3">
</div>
<ol class="org-ol">
<li><a id="org1986361"></a><a href="https://github.com/ieure/scratch-el">scratch: Create scratch buffers that are in the same mode as the current buffer</a><br />
<div class="outline-text-5" id="text-2-7-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">scratch</span>
  <span style="color: #c678dd;">:commands</span>
  (scratch))
</pre>
</div>
</div>
</li>
<li><a id="orgfd91af0"></a><a href="https://github.com/Fanael/persistent-scratch/tree/71371a7ce9846754276350fd577dc7543eb52878">persistent-scratch: Preserve the scratch buffer across Emacs sessions</a><br />
<div class="outline-text-5" id="text-2-7-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">persistent-scratch</span>
  <span style="color: #c678dd;">:init</span>
  (persistent-scratch-setup-default))
</pre>
</div>
</div>
</li>
<li><a id="org6b56fba"></a><a href="https://github.com/EricCrosson/unkillable-scratch/tree/b24c2a760529833f230c14cb02ff6e7ec92288ab">unkillable-scratch: Disallow the scratch buffer from being killed</a><br />
<div class="outline-text-5" id="text-2-7-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">unkillable-scratch</span>
  <span style="color: #c678dd;">:ensure</span> t
  <span style="color: #c678dd;">:config</span>
  (unkillable-scratch t)
  (<span style="color: #51afef;">setq</span> unkillable-scratch-do-not-reset-scratch-buffer t))
</pre>
</div>
</div>
</li>
<li><a id="org81445e4"></a><a href="https://github.com/joaotavora/yasnippet/tree/e45e3de357fbd4289fcfa3dd26aaa7be357fb0b8">yasnippet: Snippet Extension for Emacs</a><br />
<div class="outline-text-5" id="text-2-7-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">yasnippet</span>
  <span style="color: #c678dd;">:commands</span> (yas-insert-snippet)
  <span style="color: #c678dd;">:config</span>
  (yas-global-mode 1))
</pre>
</div>
</div>
</li>
<li><a id="orga0fa7bf"></a><a href="https://github.com/AndreaCrotti/yasnippet-snippets/tree/15e4b08f7484c049d6b043263c5e09bc73846e32">yasnippet-snippet: Collection of yasnippet snippets</a><br />
<div class="outline-text-5" id="text-2-7-3-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">yasnippet-snippets</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">yasnippet-snippets</span>))
</pre>
</div>
</div>
</li>
<li><a id="org943bfb4"></a><a href="https://github.com/abo-abo/auto-yasnippet/tree/624b0d9711222073a2a3f2186e2605eb99fc83c9">auto-yasnippet: Quickly create disposable yasnippets</a><br />
<div class="outline-text-5" id="text-2-7-3-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">auto-yasnippet</span>
  <span style="color: #c678dd;">:config</span>
  (<span style="color: #51afef;">require</span> '<span style="color: #a9a1e1;">auto-yasnippet</span>))
</pre>
</div>
</div>
</li>
<li><a id="org42f871e"></a><a href="https://github.com/hniksic/emacs-htmlize/tree/8db0aa6aab77475a732b7363f0d57bd3933c18fd">htmlize: Convert buffer text and decorations to HTML</a><br />
<div class="outline-text-5" id="text-2-7-3-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">htmlize</span>)
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge648e97" class="outline-4">
<h4 id="orge648e97"><span class="section-number-4">2.7.4</span> Epub</h4>
<div class="outline-text-4" id="text-2-7-4">
</div>
<ol class="org-ol">
<li><a id="org8b50bdd"></a>Nov: Read EPUBs<br />
<div class="outline-text-5" id="text-2-7-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #51afef;">use-package</span> <span style="color: #a9a1e1;">nov</span>
  <span style="color: #c678dd;">:mode</span> (<span style="color: #98be65;">"\\.epub\\'"</span> . nov-mode))
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: alexander</p>
<p class="date">Created: 2019-06-16 Sun 12:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
